[
    {
        "Title": " Love",
        "Artist": "Kendrick Lamar ",
        "Year": "(2017)",
        "Lyrics": "[Intro: Kendrick Lamar]\nDamn, love or lust\nDamn, all of us\n\n[Chorus: Zacari & Kendrick Lamar]\nGive me a run for my money\nThere is nobody, no one to outrun me\n(Another world premiere)\nSo give me a run for my money\nSippin' bubbly, feelin’ lovely, livin' lovely\nJust love me\nI wanna be with you, ayy, I wanna be with\nJust love me, just love me, just love\nI wanna be with you, ayy, I wanna be with\nLove me\nI wanna be with you\nLove me, just love me\n\n[Refrain: Kendrick Lamar & Zacari]\nIf I didn't ride blade on curb, would you still love me?\nIf I made up my mind at work, would you still love me?\nKeep it a hundred, I’d rather you trust me than to love me\nKeep it a whole one hund', don't got you, I got nothin' (Uh, uh)\n\n[Verse 1: Kendrick Lamar]\nAyy, I got somethin'\nHol' up, we gon' function, ayy, no assumptions, ayy\nFeelin' like Tyson with it\nKnock it out twice, I’m with it\nOnly for the night, I’m kiddin'\nOnly for life, yeah, only for life, yeah\nOnly for life, let’s get it\nHit that shoulder lean\nI know what comin' over me\nBackstroke oversea\nI know what you need\nAlready on ten, all money come in\nAll feeling go out, this feeling don't drought\nThis party won't end\n\n[Refrain: Kendrick Lamar & Zacari]\nIf I didn’t ride blade on curb, would you still love me?\nIf I minimized my net-worth, would you still love me?\nKeep it a hundred, I'd rather you trust me than to love me\nKeep it a whole one hund', don't got you, I got nothin' (Uh, uh)\n\n[Chorus: Zacari & Kendrick Lamar]\nGive me a run for my money\nThere is nobody, no one to outrun me\nSo give me a run for my money\nSippin' bubbly, feelin' lovely, livin' lovely\nJust love me\nI wanna be with you, ayy, I wanna be with\nJust love me, just love me, just love\nI wanna be with you, ayy, I wanna be with\nLove me\nI wanna be with you\nLove me, just love me\n\n[Verse 2: Kendrick Lamar & Zacari]\nI'm on the way\nWe ain't got no time to waste\nPoppin' your gum on the way (love me)\nAm I in the way?\nI don't wan' pressure you none\nI want your blessing today (love me)\nOh, by the way, open the door by the way\nTold you that I'm on the way (love me)\nI'm on the way, I know connection is vague\nPick up the phone for me, babe\nDammit, we jammin'\nBad attitude from yo' nanny\nCurves and your hips from yo' mammy\nRemember Gardena, I took the studio camera\nI know Top will be mad at me\nI had to do it, I want your body, your music\nI bought the big one to prove it\nLook what you made\nTold you that I'm on the way\nI'm like a exit away, yep\n\n[Refrain: Kendrick Lamar & Zacari]\nIf I didn't ride blade on curb, would you still love me?\nIf I minimized my net-worth, would you still love me?\nKeep it a hundred, I'd rather you trust me than to love me\nKeep it a whole one hund', don't got you, I got nothin' (Uh, uh)\n\n[Chorus: Zacari & Kendrick Lamar]\nGive me a run for my money\nThere is nobody, no one to outrun me\nSo give me a run for my money\nSippin' bubbly, feelin' lovely, livin' lovely\nJust love me\nI wanna be with you, ayy, I wanna be with\nJust love me, just love me, just love me\nI wanna be with you, ayy, I wanna be with\nLove me\nI wanna be with you\nLove me, just love me"
    },
    {
        "Title": " Temptations",
        "Artist": "2Pac",
        "Year": " (1995)",
        "Lyrics": "[Sample]\nHeyyyy! Heyy-ayyaahhyy\n\n[Intro: 2Pac]\nYo, Mo Bee, mayn, drop that shit!\nYou know what time\nBoo-yaow! I know it's time for you\nSo grab one by the hand, you know what I'm sayin'?\nAnd uh, throw up that finger!\nHey yo, throw y'all fingers up!\nThug style, baby, thug style, y'know?\n\n[Verse 1: 2Pac]\nTell me, baby, are you lonely? Don't wanna rush ya\nI can help ya if you're only, let me touch ya\nIf I'm wrong, love, tell me, 'cause I get caught up\nIn the life I live, it's hell, see, I never thought\nI'd see the day when I would calm down, you ain't heard?\nI've been known to clown and get around, that's my word\nSee you walkin' and you lookin' good, yes indeed\nGot a body like a sex fiend, you're killin' me\nWith your attitude to match, right? Don't be phony\nCause I hate it when you act like, you don't know me\nI've been stressin' in the spotlight, I want the fame\nBut the industry's a lot like, a crap game\nAin't no time for commitment, I gotta go\nCan't be with you every minute miss, another show\nAnd even though I'm known for my one night stand\nLook here, I wanna be an honest man, but temptations go—\n\n[Interlude: 2Pac]\nThrow up the finger!\nAnd all my homies go\nThrow them the finger!\nYou know what, baby, it's like—\n\n[Chorus: Easy Mo Bee]\nI know you've been searchin' for someone\nTo make you happy and get the job done\nYou say you needed a man with money\nBut I can't be there, and will you still care?\n\n[Verse 2: 2Pac]\nWill I cheat or will I be committed? Heaven knows\nGettin' weak and I wanna hit it, so here I go\nIn my ride and I'm all in, gettin' high\nI can hear the people callin', I'm passin' by\nEverybody knows I'm ballin', and to God\nGotta keep myself from fallin', but it's hard\nAll the cuties know I'm under pressure, what do I do?\nGettin' shaky when she pull the dress up, and say it's cool\nShould I stroke or should I wait a while? You decide\nIf you tell me that you don't want it, that's a lie\nMove close and let me whisper, some dirty words\nIn your ears as I kiss ya on every curve\nSlow down baby, don't rush, I like it slow\nCan't hold it any longer, so let it go\nOpen the gates to your waterfall up in heaven\nAnd don't worry, I let myself in, all I heard was—\n\n[Interlude: 2Pac]\nGive 'em the finger!\nAll my homies go, throw your fingers up!\nThat's just the thug in me, girl, you know\nPeep out all my homies, y'know, it's like—\n\n[Chorus: Easy Mo Bee]\nI know you've been searchin' for someone\nTo make you happy and get the job done\nYou say you needed a man with money\nBut I can't be there, and will you still care?\n\n[Verse 3: 2Pac]\nA lot of people think it's easy to settle down\nGot a woman that'll please me in every town\nI don't wanna but I gotta do it, the temptation\nGot me ready to release the fluid, sensation\nSit down and conversate like you know me, take my hand\n'Cause even thugs get lonely, understand\nEven the hardest of my homies need attention\nCatch you blowin' up the telephone, reminiscin'\nI wanna take you to the movies and the park\nLet's find a spot for you to do me in the dark\nNow that it's passion, hold me tight\nDon't need lights, I can see you by the moonlight\nI know your man ain't lovin' you right\nYou're lonely and depressed, you need a thug in your life\nEnough talkin', you want me to leave I'll get to walkin'\nSee you later, 'cause baby, I'm a player, and all I heard was—\n\n[Outro: 2Pac]\nGive 'em the finger, and all my homies go\nYo, this how we gonna do this in the nine-trey, y'know?\nThrow your fingers up!\nYou know? They gonna peep this\nThis how we run game on you\nAll my niggas go, uptown in the, give 'em the finger!\nThrow your hands up, give 'em the finger!"
    },
    {
        "Title": " The Light",
        "Artist": "Common",
        "Year": " (2000)",
        "Lyrics": "[Produced by J Dilla]\n\n[Intro]\nYeah, doo-doo-doo\nDoo-doo-d-doo, diggy-doo, yo\n\n[Hook]\nThere are times\nWhen you'll need someone\nI will be by your side\nThere is a light that shines\nSpecial for you and me\n\n[Verse 1]\nI never knew a luh, luh-luh, a love like this\nGotta be somethin' for me to write this\nQueen, I ain't seen you in a minute\nWrote this letter, and finally decide to send it\nSigned, sealed, delivered, for us to grow together\nLove has no limit, let's spend it slow forever\nI know your heart is weathered by what studs did to you\nI ain't gon' assault them, ‘cause I probably did it too\nBecause of you, feelings I handle with care\nSome niggas recognize the light\nBut they can't handle the glare\nYou know I ain't the type to walk around with matchin' shirts\nIf relationship is effort I will match your work\nI want to be the one to make you happiest\nAnd hurt you the most\nThey say the end is near, it's important that we close\nTo the most high\nRegardless of what happen, on Him let's rely\n\n[Hook]\nThere are times\nWhen you'll need someone\nI will be by your side\nThere is a light that shines\nSpecial for you and me\n\n[Verse 2]\nIt's important we communicate\nAnd tune the fate of this union to the right pitch\nI never call you my bitch or even my boo\nThere's so much in a name and so much more in you\nFew understand the union of woman and man\nAnd sex and a tingle is where they assume that it land\nBut that's fly by night, for you in the sky I write\nFor in these cold Chi night's moon, you my light\nIf Heaven had a height, you would be that tall\nGhetto to coffee shop, through you I see that all\nLet's stick to understandin' and we won't fall\nFor better or worse times, I hope to me you call\nSo I pray every day more than anything\nFriends we'll stay as we begin to lay\nThis foundation for a family, love ain't simple\nWhy can't it be anything worth havin' you work at annually?\nGranted we known each other for some time\nIt don't take a whole day to recognize sunshine\n\n[Hook]\nThere are times\nWhen you'll need someone\nI will be by your side\nThere is a light that shines\nSpecial for you and me\n\n[Verse 3]\nIt's kind of fresh you listen to more than hip-hop\nAnd I can catch you in the mix from beauty to thrift shop\nPlus you shit pop when it's time to\nThinkin' you fresh, suggestin' beats I should rhyme to\nAt times when I'm lost I try to find you\nYou know to give me space when it's time to\nMy heart's dictionary defines you, it's love and happiness\nTruthfully it's hard tryin' to practice abstinence\nThe time we committed love, it was real good\nHad to be for me to arrive and it still feel good\nI know the sex ain't gon' keep you\nBut as my equal, it's how I must treat you\nAs my reflection in light I'ma lead you\nAnd whatever's right I'ma feed you\nDigga-da, digga-da, digga-da, digga-digga-da-da\nYo, I tell you the rest when I see you; peace!\n\n[Hook]\nThere are times\nWhen you'll need someone\nI will be by your side\nThere is a light that shines\nSpecial for you and me\n\n[Outro]\nI'll take my chances\nBefore they pass\nPass me by, oh, darling\nYou need to look at the other side\nYou'll agree"
    },
    {
        "Title": " Bound 2",
        "Artist": "Kanye West ",
        "Year": " (2013)",
        "Lyrics": "[Intro: Ponderosa Twins Plus One & Brenda Lee]\nB-B-B-B-Bound to fall in love\nBound to fall in love\nUh-huh, honey\n\n[Refrain: Kanye West]\nAll them other niggas lame, and you know it now\nWhen a real nigga hold you down, you s'posed to drown\n\n[Chorus: Ponderosa Twins Plus One, Brenda Lee & Kanye West]\nBound to fall in love (Bound)\nB-B-B-B-Bound to fall in love (Bound)\nUh-huh, honey\n\n[Verse 1: Kanye West]\nWhat you doin' in the club on a Thursday?\nShe say she only here for her girl birthday\nThey ordered champagne but still look thirsty\nRock Forever 21 but just turned thirty\nI know I got a bad reputation\nWalking-round-always-mad reputation\nLeave-a-pretty-girl-sad reputation\nStart a Fight Club, Brad reputation\nI turnt the nightclub out of the basement\nI'll turn the plane around, your ass keep complainin'\nHow you gon' be mad on vacation?\nDutty wining 'round all these Jamaicans\nUh, this that prom shit\nThis that what-we-do-don't-tell-your-mom shit\nThis that red-cup-all-on-the-lawn shit\nGot a fresh cut, straight out the salon, bitch\n\n[Bridge: Charlie Wilson & Brenda Lee]\nI know you're tired of lovin', of lovin'\nWith nobody to love, nobody, nobody (Uh-huh, honey)\n\n[Chorus: Kanye West, Ponderosa Twins Plus One & Brenda Lee]\nClose your eyes and let the word paint a thousand pictures\nOne good girl is worth a thousand bitches\nBound (Bound to fall in love)\nBound (Bound to fall in love)\nUh-huh, honey\n\n[Verse 2: Kanye West]\nI wanna fuck you hard on the sink\nAfter that, give you somethin' to drink\nStep back, can't get spunk on the mink\nI mean damn, what would Jeromey Romey Romey Rome think?\nHey, you remember where we first met?\nOkay, I don't remember where we first met\nBut hey, admittin' is the first step\nAnd hey, you know ain't nobody perfect\nAnd I know, with the hoes I got the worst rep\nBut hey, their backstroke I'm tryna perfect\nAnd hey, ayo, we made it: Thanksgivin'\nSo hey, maybe we can make it to Christmas\nShe asked me what I wished for on my wishlist\nHave you ever asked your bitch for other bitches?\nMaybe we could still make it to the church steps\nBut first, you gon' remember how to forget\nAfter all these long-ass verses\nI'm tired, you tired, Jesus wept\n\n[Bridge: Charlie Wilson & Brenda Lee]\nI know you're tired of lovin', of lovin'\nWith nobody to love, nobody, nobody\nSo just grab somebody, no leavin' this party\nWith nobody to love, nobody, nobody\nUh-huh, honey\n\n[Chorus: Kanye West, Ponderosa Twins Plus One, & Brenda Lee]\nJerome's in the house, watch your mouth\nJerome's in the house, watch your mouth\nBound to fall in love\nBound\nBound to fall in love\nBound\nUh-huh, honey\n\n[Produced by Kanye West and Che Pope with additional production from Eric Danchild, Noah Goldstein, No ID and Mike Dean]\n\n[Video directed by Nick Knight]"
    },
    {
        "Title": " What You Want",
        "Artist": "Ma$e ",
        "Year": " (1998)",
        "Lyrics": "[Intro: Total]\nTell me what you want\nTell me what you want\nJust tell me what you want\nTell me what you want\nTell me what you want\nTell me what you want\n\n[Hook: Total]\nTell me what you want for me\nTake a look at what you see\nLet me know if this right here\nIs something you can have for years\nTell me what you want for me\nTake a look at what you see\nLet me know if this right here\nIs something you can have for years\n\n[Verse 1: Ma$e]\nNow Ma$e be the man wanna see you doing good\nI don't wanna get rich, leave you in the hood\nGirl, in my eyes you the baddest\nThe reason why I love you, you don't like me cuz my status\nI don't wanna see you with a carriage living average\nI wanna do my thing so we be established\nAnd I don't want you rock in them fabrics\nGirl, I wanna give you carats 'till you feel you a rabbit\nAnything in your path, you want you can have\nWalk through the mall, if you like it you can grab\nTotal it all up and put it on my tab\nAnd then tell your friends all the fun you had\n\n[Hook: Total]\nTell me what you want for me\nTake a look at what you see\nLet me know if this right here\nIs something you can have for years\nTell me what you want for me\nTake a look at what you see\nLet me know if this right here\nIs something you can have for years\n\n[Verse 2: Ma$e]\nHey Mama, won't you come here to Papa?\nYou don't like the way your tata's lookin at Shada?\nIn a 600 ain't no smokin' cigada\nCome over here, I think I see your baby faddah\nHere ya go the number to my casa\nIf you in a rush you call me mañana\nWhatever you need girlfriend, I got the whole enchilada\nJust the way you like it, Ma$e gon' do you propa'\nGirl, I can tell you was meant for me\nI can tell by the way you was sent to me\nWhile I'm on tour trying to make them centuries\nAnd they ask who your man, you better mention me\nIf you don't you know you got a problem\nSaid you want no beef, girlfriend, don't start none\nAnd it just so happens that I'm seeing cash\nCuz you messed up a lot just trying to be fast\nAnd I ain't gonna ask who smashed the E-Class\nPull up to the crib with the whole front crashed\nNow you wanna laugh, good thing that's the past\nIf you ever lie again, girl, that'll be your last\n\n[Hook: Total]\nTell me what you want for me\nTake a look at what you see\nLet me know if this right here\nIs something you can have for years\nTell me what you want for me\nTake a look at what you see\nLet me know if this right here\nIs something you can have for years\n\n[Verse 3: Ma$e]\nNow the more you treat me royal I adore you\nThat's why I don't mind doing these things for you\nYou did things for me I wouldn't believe you did\nThat's why I always want to keep you here\nIn a year or two, girl, I could see you with my kids\nGirl, you make a thug want to get a legal gig\nIt's only right we spend our lonely nights\nGettin' crazy biz till we awake the kids\nDon't get too loud, got respect for you honey\nTo keep it all real, you come second to my money\nAnd can you be my ghetto love prophecy?\nEverybody love you girl, not just me\nAnd I know that you really care a lot for me\nWanna see you happy even if it's not with me (not with me)\nEven if it's not with me\n\n[Hook: Total]\nTell me what you want for me\nTake a look at what you see\nLet me know if this right here\nIs something you can have for years\nTell me what you want for me\nTake a look at what you see\nLet me know if this right here\nIs something you can have for years\nTell me what you want for me\nTake a look at what you see\nLet me know if this right here\nIs something you can have for years\nTell me what you want for me\nTake a look at what you see\nLet me know if this right here\nIs something you can have for years\nFor years\nTell me what you want for me\nTake a look at what you see\nLet me know if this right here\nIs something you can have for years\nTell me what you want for me\nTake a look at what you see\nLet me know if this right here\nIs something you can have for years"
    },
    {
        "Title": " Best I Ever Had",
        "Artist": "Drake",
        "Year": " (2009)",
        "Lyrics": "[Intro]\nYou know, a lot of girls be\nThinkin' my songs are about them\nThis is not to get confused\nThis one's for you\n\n[Chorus]\nBaby, you my everything, you all I ever wanted\nWe could do it real big, bigger than you ever done it\nYou be up on everything, other hoes ain't never on it\nI want this forever, I swear I can spend whatever on it\n'Cause she hold me down every time I hit her up\nWhen I get right, I promise that we gon' live it up\nShe made me beg for it 'til she give it up\nAnd I say the same thing every single time\nI say, you the fuckin' best (Ayy), you the fuckin' best (Ayy)\nYou the fuckin' best (Ayy), you the fuckin' best (Ayy)\nYou the best I ever had (Ayy), best I ever had (Ayy)\nBest I ever had (Ayy), best I ever had\nI say, you the fuckin'\n\n[Verse 1]\nKnow you got a roommate, call me when there's no one there\nPut the key under the mat and you know I be over there (Yup)\nI be over there, shawty, I be over there\nI be hittin' all the spots that you ain't even know was there\nAnd you don't even have to ask twice\nYou could have my heart or we could share it like the last slice\nAlways felt like you was so accustomed to the fast life\nHave a nigga thinkin' that he met you in a past life\nSweatpants, hair tied, chillin' with no make-up on\nThat's when you're the prettiest\nI hope that you don't take it wrong\nYou don't even trip when friends say\n\"You ain't bringin' Drake along?\"\nYou know that I'm workin', I'll be there soon as I make it home\nAnd she a patient in my waiting room\nNever pay attention to the rumors and what they assume\nAnd until them girls prove it\nI'm the one that never get confused with, 'cause\n\n[Chorus]\nBaby, you my everything, you all I ever wanted\nWe could do it real big, bigger than you ever done it\nYou be up on everything, other hoes ain't never on it\nI want this forever, I swear I can spend whatever on it\n'Cause she hold me down every time I hit her up\nWhen I get right, I promise that we gon' live it up\nShe made me beg for it 'til she give it up\nAnd I say the same thing every single time\nI say, you the fuckin' best (Ayy), you the fuckin' best (Ayy)\nYou the fuckin' best (Ayy), you the fuckin' best (Ayy)\nYou the best I ever had (Ayy), best I ever had (Ayy)\nBest I ever had (Ayy), best I ever had\nI say, you the fuckin'\n\n[Verse 2]\nSex, Love, Pain, baby, I be on that Tank shit\nBuzz so big I could probably sell a blank disc\nWhen my album drop, bitches'll buy it for the picture\nAnd niggas'll buy it too and claim they got it for they sister\nMagazine paper, girl, the money ain't the issue\nThey bring dinner to my room and ask me to initial\nShe call me the referee 'cause I be so official\nMy shirt ain't got no stripes, but I can make your pussy whistle\nLike the Andy Griffith theme song\nAnd who told you to put them jeans on?\nDouble cup love, you the one I lean on\nFeelin' for a fix, then you should really get your fiend on\nYeah, just know my condo is the crack spot\nEvery single show, she out there reppin' like a mascot\nGet it from the back and make your fuckin' bra strap pop\nAll up in your slot 'til a nigga hit the jackpot, I'm saying\n\n[Chorus]\nBaby, you my everything, you all I ever wanted\nWe could do it real big, bigger than you ever done it\nYou be up on everything, other hoes ain't never on it\nI want this forever, I swear I can spend whatever on it\n'Cause she hold me down every time I hit her up\nWhen I get right, I promise that we gon' live it up\nShe made me beg for it 'til she give it up\nAnd I say the same thing every single time\nI say, you the fuckin' best (Ayy), you the fuckin' best (Ayy)\nYou the fuckin' best (Ayy), you the fuckin' best (Ayy)\nYou the best I ever had (Ayy), best I ever had (Ayy)\nBest I ever had (Ayy), best I ever had\nI say, you the fuckin' best (Ayy), you the fuckin' best (Ayy)\nYou the fuckin' best (Ayy), you the fuckin' best (Ayy)\nYou the best I ever had (Ayy), best I ever had (Ayy)\nBest I ever had (Ayy), best I ever had\n\n[Outro]\nUhh, ah yeah\nSee, this the type of joint you gotta dedicate to somebody\nJust make sure they that special somebody\nYoung Money, yeah, yeah\nYou know who you are\nI got you"
    },
    {
        "Title": " Eye Know",
        "Artist": "De La Soul",
        "Year": " (1989)",
        "Lyrics": "[Verse 1: Pos]\nGreetings girl and welcome to my world of phrase\nI'm right up to bat\nIt's a Daisy Age and you're about to walk top-stage\nSo wipe your Lottos on the mat\nHip-hop love this is and don't mind when I quiz your\nInvolvements before the sun\nBut clear your court cause this is a one-man sport\nAnd who's better for this than Plug One\nNow you don't have to worry about me squashin' other deals\nCause they've already been squooshed\nFreeze a frame about moods the same which we can continue\nRight behind the bush\nYou'll stay with me\nEye Know this\nBut not because of all my Earthly treasures\nOr regardless to the fact that I'm Posdnuos\nBut because\n\n[Chorus]\nEye know Eye love you better\n\n[Verse 2: Dove]\nMay I cut this dance to introduce myself as\nThe chosen one to speak\nLet me lay my hand across yours\nAnd aim a kiss upon your cheek\nThe name's Plug Two\nAnd from the soul I bring you\nThe Daisy of your choice\nMay it be filled with the pleasure principle\nIn circumference to my voice\nAbout those other Jennys I reckoned with\nLost them all like a homework excuse\nThis time the Magic Number is two\nCause it takes two, not three, to seduce\nMy destiny of love is brought to an apex\nSex is a mere molecule\nIn this world of love that I have for you\nIt's true\n\n[Chorus]\nEye know Eye love you better\n\n[Verse 3: Pos]\nNow it's time to let this rhyme style\nGet somewhat poured in the mold\nHold my hand and we'll pick my plantation\nOf Daisies for a bouquet of Soul\nLife will begin at the cut of a rim\nTake it as filled to the rim as in brim\nSqueeze your stoop like Betty Boop\nWe'll make Campbell's Alphabet Soup\nAnd spell Plug One's within\nForward march is the say\nWhen transistors will play\nCome into bed is the mood\nDolby sound will be then top crowned\nWhen I put the needle into your groove\nI got a good thing\nAnd in full swing\nI show this in gifts, words or letters\nBut even without those three\nEye know you'll be close to me cause\n\n[Chorus]\nEye know Eye love you better\n\n[Verse 4: Dove]\nIt's I again and the soul that I send\nIs taking steps to reach your heart\nAny moment you feel alone\nI can fill up your empty part\nWe can ascend 'till we reach De La Heaven\nAnd in a spin we'll hit the Top Ten\nThen we will meet Mr Stuckie\nAnd Pos' brother Lucky will preach\nLet the wedding begin\nShot by an arrow of cupid\nThrough the string of a G-clef\nMy dear, I claim you're def\nAnd if you can hear me, by golly gee\nTrugoy is ready for what you posess\nWe could live in my Plug Two home\nAnd on Mars where we could be all alone\nAnd we make a song for two\nPicture perfect things and I sing of how\n\n[Chorus]\nEye know Eye love you better"
    },
    {
        "Title": " Montego Bae",
        "Artist": "Noname ",
        "Year": " (2018)",
        "Lyrics": "[Chorus: Ravyn Lenae]\nI think I really wanna go someday\nI wanna fall in love in Montego Bay\nI know my heart is wherever he may stay\nI think I really wanna go someday\nI wanna fall in love in Montego Bay\nI know my heart is wherever he may stay\n\n[Verse 1: Ravyn Lenae]\nHow's it feel to be on my mind?\nI can't believe I found you in time\nI had a dream across seas for you and me\nSun ray on my lap, I love it on my back\nOh sweet bae holy sun\nOh future husband, undress me under the moon\nSweet bae someday will come soon\n\n[Chorus: Ravyn Lenae]\nI think I really wanna go someday\nI wanna fall in love in Montego Bay\nI know my heart is wherever he may stay\nI think I really wanna go someday\nI wanna fall in love in Montego Bay\nI know my heart is wherever he may stay\n\n[Verse 2: Noname]\nMy lil' baby wanna smoke with me, dread head in a party getting close to me\nSaid hol' up, slow up, roll up, roll up, dance slow, baby, dance slow, baby smoke\nNiggas off the gasoline, smoking backwoods in the backwoods, living lavishly\nOoh ooh, that's my Montego Bae\nI know my nigga like me, I know he cook his curry spicy\nI know he eat me like I'm wifey, he know my hotel over pricey\nSo he gon' fuck me like I'm Oprah, classy bitch only use a coaster\nNow I'm swimmin' in the money with a ducky or 2\nReading Toni Morrison in a nigga canoe\n'Cause a bitch really 'bout her freedom 'cause a bitch suckin dick in the new Adidas\nAnd yes and yes, I'm problematic too\nAnd yes and yes, I lick 'em up, oh yes I really do\nProtection is a wave, wave 'cause we be open too\nJamaica thank you for my baby, I'm in love wit' you"
    },
    {
        "Title": " Make Me Better",
        "Artist": "Fabolous ",
        "Year": " (2007)",
        "Lyrics": "[Intro: Ne-Yo & (Fabolous)]\n(TIMBO!) Hey! (NE-YO!) Say what? (LOSO!) Hey! Hey!\n\n[Chorus: Ne-Yo]\nI'm a movement by myself (Oh!)\nBut I'm a force when were together\nMami I'm good all by myself (Oh!)\nBut baby you, you make me better\n(You make me better) You make me better\n(You make me better) You make me better\n(You make me better) You make me better\n(You make me better) You make me better\n\n[Verse 1: Fabolous & (Ne-Yo)]\nYou plus me, it equals better math\nYour boy a good look but she my better half\nI'm already bossin, already flossin\nBut why have the cake if it ain't got the sweet frostin\n(You're-You're-You're-You're) You're keepin me on my A game\n(With-With-With-With) Without havin the same name\n(They-They-They-They-They) They might flame\n(But-But-But-But) But shorty we burn it up\nThe sag and my swag, pep in my step\nDaddy do the Gucci mami in Giuseppes\nGuess it's a G thing whenever we swing\nI'm a need Coretta Scott if I'm 'gon be King (Oooh)\n\n[Chorus: Ne-Yo]\nI'm a movement by myself (Oh!)\nBut I'm a force when were together\nMami I'm good all by myself (Oh!)\nBut baby you, you make me better\n(You make me better) You make me better\n(You make me better) You make me better\n(You make me better) You make me better\n(You make me better) You make me better\n\n[Verse 2: Ne-Yo]\nFirst thing's first, I does what I do\nBut everything I am she's my improve\nI'm already bossin, I'm already fly\nBut if I'm a star, she is the sky\n(And-And-And) And when I feel like I'm on top\n(She-She-She) She give me reason then I stop\n(And-And-And-And-And) And though I'm hot\n(To-To-To) Together we burn it up\n\n[Verse 3: Fabolous & (Ne-Yo)]\nThe caked up cut, the cleaned up ice\nThe shorty come around, I clean up nice\nDynamic duo, Batman and Robin\nWhoever don't like it is that man's problem\n(AND-AND-AND) And when I feel like I'm tired\n(MA-MA-MA) Mami be takin me higher\n(I'M-I'M-I'M-I'M-I'M) I'm on fire\n(BUT-BUT-BUT) But shorty we burn it up\n\n[Chorus: Ne-Yo]\nI'm a movement by myself (Oh!)\nBut I'm a force when were together\nMami I'm good all by myself (Oh!)\nBut baby you, you make me better\n(You make me better) You make me better\n(You make me better) You make me better\n(You make me better) You make me better\n(You make me better) You make me better\n\n[Bridge: Ne-Yo]\nCause on the side of every great man\nYou could find a woman like a soldier holdin him down\n\n[Verse 4: Fabolous]\nShe treats me like a don, watches for the hit\nChecks where I go, even watches who I'm with\nThe right when I'm wrong, so I never slip\nShow me how to move, that's why I never trip\nAnd baby girl you so major they should front page ya (Front page ya)\nGod bless the parents who made ya (Who made ya)\nMiddle finger anybody who hate the (Who hate the) way we burn it up\n\n[Chorus: Ne-Yo]\nI'm a movement by myself (Oh!)\nBut I'm a force when were together\nMami I'm good all by myself (Oh!)\nBut baby you, you make me better\n(You make me better) You make me better\n(You make me better) You make me better\n(You make me better) You make me better\n(You make me better) You make me better\n\n[Outro: Fabolous & (Ne-Yo)]\n(Ahhhhhhhhh!!!!!!!!!!)\nYeah baby, them lames you playin with, they 'gon push you down\nWe tryin to compliment you you know, make you better\nTop Notch Tim, Nice Look Ne-Yo, Livin Good Loso\nThey ask you how you doin now, tell 'em better than them\nHA HA HA HA HA HA!!!!!!!!!!!\n\n[Chorus: Ne-Yo]\nI'm a movement by myself (Oh!)\nBut I'm a force when were together\nMami I'm good all by myself (Oh!)\nBut baby you, you make me better\n(You make me better) You make me better\n(You make me better) You make me better\n(You make me better) You make me better\n(You make me better) You make me better"
    },
    {
        "Title": " Searching",
        "Artist": "Pete Rock & CL Smooth ",
        "Year": " (1995)",
        "Lyrics": "[Verse 1: CL Smooth]\nYou're everything that I dream about, talk about\nWalk around and brag about, cause I don't give a damn about\nWhat they say, what he say, or she say\nI'm addicted like drugs to your loving, but hey\nYou got me strung like I'm young and it's crazy\nYou're making me nervous, I don't deserve this, I'm Swayze\nI wish I could be but you really got a hold on me\nWith your sex appeal, I'm telling you how I feel, shit is real\nNow I don't really want to play myself so I say to myself:\n\"Self get a grip and don't slip\"\nCause I don't want you to think I'm some clown from out of town\nI get down, I've been around, I ain't no hand-me-down\nSo you gotta show respect for me if you're checking for me\nAnd don't sweat me cause I really don't want no sweat on me\nIf you got it, good, flaunt it\nYou know what it takes and you know how I want it\n\n[Hook (2x)]\n(I know how you want it) Don't tease me, just please me\n(I know how you want it) Now what you gonna do when you get it?\n\n[Verse 2: CL Smooth]\nEverybody knows you and they show you mad respect\nYou give me funny feelings with your million-dollar step\nNever quiet is kept, honey always stayed dip\nI'm thirsty for your love, sugar can I get a sip?\nWell maybe just a taste in the place that make your face bend\nAnd I would never try to kick it to your best friend\nSo what's the deal, what's the haps, where we at now?\nKeeping it strong, moving it along, I'm here to show you how\nSo all I wanna know is what you really wanna do\nI try to flex but sex ain't sex unless I'm sexing you\nAnd I'll be swimming in some trim with a beachfront view\nCause all I wanna do is get next to you\nNow leave your crew so we can step into my hideaway\nSo I can step into it right away\nIf you got it, good, flaunt it\nYou know what it takes and you know how I want it\n\n[Hook (2x)]\n\n[Verse 3: CL Smooth]\nBefore you sit back and think I ain't saying nothing\nYou need to sit back and think about what I'm saying\nNow relaying, my carmel flow\nSo you can see the arrow fly before it leaves the bow\nSlow like Cupid, taken from a mobster\nAt night I crack her open just like a lobster\n(My CL Smooth) It's all good baby\nNow you know why I'm stressed when you act shady\nSometimes you chit chat, now and then hide the cat\nWhen all I wanna do is just flip that\nBut there's a side to me only you can see\nOnly you can so believe in your man\nI want you to love me in a special way\nWhen I come home from making lucci to parlay\nIf you got it, good, flaunt it\nYou know what it takes and you know how I want it\n\n[Hook (4x)]"
    },
    {
        "Title": " Incredible",
        "Artist": "Future",
        "Year": " (2017)",
        "Lyrics": "[Intro]\nIt's a light day\nAin't got on nothin' but about $700 thousand worth\nThat's it\nYou know what I'm sayin'?\n\n[Verse 1]\nI was havin' trust issues\nBut I've been havin' way better luck since you\nI know it's true love with you\nTold myself I don't wanna fall in love with you\nRollin' on the eway speedin'\nFriday, just started the weekend\nXO textin', you respondin'\nWe gon' go crazy with this money\nWe do hot yoga, 92 degrees\nCan you stretch it out? Stretch it out for me\nI got somewhere to be, but it's hard to leave\nWhen you do it like you mean it, I'm proceedin'\nIs you the one? Is you the one?\nThen she looked me in my eyes\nTold me, \"Fuck them pussy niggas\nThey ain't ridin' 'cause I'm ridin'\nAnd I'm dyin' for you, baby\"\nGot me feelin'\n\n[Chorus]\nIn-in-incredible\nIn-in-incredible\nIn-in-incredible\nIncredible\nYeah, yeah\n\n[Verse 2]\nWe can do exactly what you like, baby\nAnd it's all on me\nWe can take Vicodin tonight, baby\nIt's all on me\nWe been textin' back and forth\nNow it's time to get it crackin'\nGirl, take it all out 'cause I know you active\nDid you come to talk or is you 'bout that action?\nDiamonds on my neck, moonwalkin', Michael Jackson\nI'ma have your body sweatin' like you dipped in baby oil\nI'ma do whatever it's gon' take to keep my baby spoiled\nI'ma do whatever it's gon' take to shake these haters off\nPut it on, fuck the cost\nI just wanna show you off\nI can see your flaws, she gon' take me how I am\nHit it from the back, girl, you know I'm goin' ham\nFuck the pigs, girl, you got me feelin' like the man\nYeah, yeah\n\n[Chorus]\nIn-in-incredible\nIn-in-incredible\nIn-in-incredible\nIncredible\nYeah, yeah\nWay you move your body, girl I'll give you an advance\nKnow you, girl, you fuckin' with a full-grown man\nThe way you move your body, I'ma have a change of plans\nIn-in-in-incredible\nIn-in-incredible\nIn-in-incredible\nIncredible\nYeah, yeah\n\n[Verse 3]\nI'ma have your body sweatin' like you dipped in baby oil\nI'ma do whatever it take to keep my fuckin' baby spoiled\nI'ma do whatever it takes to shake these fuckin' bitches off\nI'ma do whatever it takes and you gon' be my personal\nDance, dance, girl you dancin' like you strippin' for this gold\nRomance and we've all done been here before\nBut your passion, I hear it when you're talkin'\nWe ain't clashin', you quiet when I'm talkin'\nPut them diamonds on you, have 'em Billie Jean moonwalkin'\nPut them diamonds on you, have 'emmmmm moonwalkin'\nYou get into everything exclusively, I'm honest\nWe don't need nobody comin' inbetween this money\nThese niggas already tryna invade the embassy\nGood thing I changed and you got that remedy\nThe best thing about you, oh you're that far from me\nYou a star to me\n\n[Chorus]\nIn-in-incredible\nIn-in-incredible\nIn-in-incredible\nIncredible\nYeah, yeah\nWay you move your body, girl I'll give you an advance\nKnow you, girl, you fuckin' with a full-grown man\nThe way you move your body, I'ma have a change of plans\nIn-in-in-incredible\nIn-in-incredible\nIn-in-incredible\nIncredible\nIn-in-incredible\nIn-in-incredible\nIn-in-incredible\nIncredible\nYeah, yeah"
    },
    {
        "Title": " ROS",
        "Artist": "Mac Miller",
        "Year": " (2015)",
        "Lyrics": "[Part I]\n\n[Intro]\nAhem, ahem\nGood evening everybody\nHow's everybody doing?\nJust wanna ask you a question, um, have you, have you\nHave you been in love, before?\n\n[Verse]\nYou like your vodka with a little touch of lime\nYou should pro'bly take your heels off, 'cause you been runnin' through my mind\nOh baby, they say we're no good for each other\nAnd I can't really tell, what is this spell you put me under?\nYour love's not too kind to me\nI hate the pain, these days of rain\nYou playin' games of hide and seek, my love\nAnd I'm still tryna find you, I'm lookin' for you, babe\nAnd I'm still tryna find you, through sunshine or rain\n\n[Part II]\n\n[Intro: [?]]\nI love you\n\n[Verse 1: Mac Miller]\nYeah\nYou got your stained glass iris, diamond behind your eyelids\nAutopilot fly, my heart skip a beat like a scratched CD\nYour skin smell like butterscotch and your lips taste like kiwi\nLet's take a plane to Fiji, make a date, let's take it easy\nLove is power, swear there's somethin' 'bout her that make me nervous\nMother Earth done gave us all a gift, she made you perfect\nLet's eat some mushrooms and go to the circus\nGirl, you know I'm lovin' you just like you deserve it (Ou)\nSo, baby, make me earn it, show me the way you work it\nTell me what you afraid of, I'll spit you my favorite verses\nLet's... just go take a breath\nI want it all, every ounce of love that you got left\nYou are my drug, in love to death, feel free to fall, you are a catch\nI'm in your heart, I'm in your dream, so fuck the world, it's you and me\nShe is the only one that got away\nIf her love don't last forever then forever ain't the same, yeah\n\n[Chorus: Mac Miller, Elle Varner or Both]\nYour love is not too kind to me\nYou know my love is sugar-sweet, yeah\nThe only thing on my mind is she\nYou think about you, I've been thinking of me\nMy love, my love\nMy love, my love, yeah\nAnd I know that nothin' lasts forever (Nothing lasts forever)\nNothin' lasts forever\n\n[Verse 2: Mac Miller]\nYeah\nAnd she is cool, calm and collected, I knew that you was the one\nWhen I seen ya, leave me breathless, a-okay, I need a second\nDay-to-day, give me attention, I want to take care of you\nMarry you, somethin' I'm prepared to do, there can't be two\nYou was here, I ran from you, scared to take that step\nBut now that I am ready, you not, you up and left me\nHope your new man make you laugh like I do\nI do not mean to worry you with my obsession, I just want to be beside you\nI'm too nice, and I had to pay that price\nEverything I do is wrong (Wrong,) everything you do is right (Right)\nLet's start a family, hold on to forever, baby\nYour pussy is a palace and your head is crazy *Woman moans*\nThat bomb is detonating, look at this mess you're making\nI am the king, you are the queen, look at this chess we're playing\nOh we had a love, that love was record-breaking\nI'm sick of waitin', yeah\n\n[Chorus: Mac Miller, Elle Varner or Both]\nYour love is not too kind to me\nYou know my love is sugar-sweet, yeah\nThe only thing on my mind is she\nYou think about you, I've been thinking of me\nMy love, my love\nMy love, my love, yeah\nAnd I know that nothing lasts forever (Nothing lasts forever)\nNothing lasts forever, ever, ever\n\n[Outro: Mac Miller]\nSo gimme all of your love\nAnd I will be yours, through rain and through shine\nGimme all of your love\nYou will be mine through rain and through shine\n(Gimme your loving, babe) Yeah, yeah, yeah\n(Gimme your loving, babe) Yeah, yeah, yeah\n(Gimme your loving, babe) Yeah, yeah, yeah\n(Gimme your loving, babe) Yeah, yeah, yeah\n(Gimme your loving, babe) Yeah, yeah, yeah\n(Gimme your loving, babe) Yeah, yeah, yeah\n(Gimme your loving, babe) Yeah, yeah, yeah\n(Gimme your loving, babe) Yeah, yeah, yeah\n(Gimme your loving, babe) Yeah, yeah, yeah\n(Gimme your loving, babe) Yeah, yeah, yeah\n(Gimme your loving, babe) Yeah, yeah, yeah\n(Gimme your loving, babe) Yeah, yeah, yeah"
    },
    {
        "Title": " Shakiyla (JRH)",
        "Artist": "Poor Righteous Teachers",
        "Year": " (1990)",
        "Lyrics": "Transcribing\n\nEase up, cause this is not a love ballad\n\n[Verse 1: Wise Intelligent]\nYes I come to pay tribute to Shakiyla because you're lovely\nWord is bond, your sister loves me and I love her like no other before\nAyee\nI say I spend a lot of time with the queen I protect\nYou're the sister close to me, he take her deeper into debt\nSay sister, knowledge god that of queens your existence\nYou're no hooker, you're no slut, you're no bitch and she listens\nYou're the mother of civilization and I hate them snakes that disrespect\nAnd they often disrespect ya when they find out that I sex ya\nWondering what are they trying with knowledge of themselves\nShakiyla's civilized, she despises the drug you sell\nShakiyla deep black woman she loves me life to death\nThese savages try sweating, tell culture I say this\n\n[Hook: Culture Freedom]\nWake up from all those savage dreams\nThinking that she's yours, not mines\nThose earrings and silly chains\nIt's really just a waste of time\nThe queen is mine\nWake up\nThe wise black queen is mine\nShe's mine\nShe's mine\n(Ease up!)\n\n[Verse 2: Wise Intelligent]\nThis one's dedicated to Shakiyla ’cause she need me\nWord is bond, the sister needs me\nAnd I need her like no other before\nAyee\nI tell ya strong be the vibe that combines us together\nLots of love, trust, and truth, understanding that's forever\nNot biting, no one shooting\nHope like hell they [??]\nPerfection rules the ignorance, loves not blind boy\nI see clearly daily baby crazy I gotcha\nShe's all this, she's all that\nAnd it gets greater by the hour\nWithout the acts of separation\nThough that's one of woman's power\nBlack man's guide to understanding\nThe black woman's full flower\n[?]\nAt least the cresses of her soul\nShakiyla deep black woman she loves me life to death\nThese savages try sweat, Culture tell them I say this\n\n[Hook: Culture Freedom]\nWake up from all those savage dreams\nThinking that she's yours, not mines\nThose earrings and silly chains\nIt's really just a waste of time\nThe queen is mine\nWake up\nThe wise black queen is mine\nShe's mine\nShe's mine\n(Ease up!)\n\n[Verse 3: Wise Intelligent]\nThis one that I kick about Shakiyla ’cause she want me\nWord is bond, the sister want me\nAnd I want her like no other before\nAyee\nBut no one's ever told me love could be so much fun\n[??] day just like the sun\n[??]\nSome may say the phrase but they're plotting on our [??]\nThe place in which we be that is the place they never been\nA-gin-and-a-gin-and-a-git-ya ask me Wise do ya love me?\nAnd without hesitation I'll say, Earth ya knows I do\nThen ask her why she hates me\nAnd she'll say I know ya love her\nThe reason that I ask is just to hear ya say you do\nShakiylah's deep black woman and she loves me life to death\nWhen Savages try sweat, Culture tell them I say this\n\n[Hook: Culture Freedom (Wise Intelligent)]\nWake up from all those savage dreams\nThinking that she's yours, not mine\nThose earrings and silly chains\nIt's really just a waste of time\nThe queen is mine\n(All respects due to the black woman on the planet Earth)\nWake up\nThe wise black queen is mine\nShe's mine\nShe's mine"
    },
    {
        "Title": " See You Again",
        "Artist": "Tyler the Creator ",
        "Year": " (2017)",
        "Lyrics": "[Intro: Tyler, The Creator]\nOkay, okay, okay, okay\nOkay, okay, oh\n\n[Verse 1: Tyler, The Creator]\nYou live in my dream state\nRelocate my fantasy\nI stay in reality\nYou live in my dream state\nAny time I count sheep\nThat's the only time we make up, make up\nYou exist behind my eyelids, my eyelids\nNow I don't wanna wake up\n\n[Pre-Chorus: Tyler, The Creator]\n20/20, 20/20 vision\nCupid hit me, Cupid hit me with precision, eye\nWonder if you look both ways\nWhen you cross my mind\nI said, I said\nI'm sick of, sick of, sick of, sick of chasing\nYou're the one that's always running through my day dreams, I\nI can only see your face when I close my eyes\n\n[Chorus: Kali Uchis & Tyler, The Creator]\nCan I get a kiss?\nAnd can you make it last forever?\nI said I'm 'bout to go to war\nAnd I don't know if I'ma see you again\nCan I get a kiss? (Can I?)\nAnd can you make it last forever? (Can you?)\nI said I'm 'bout to go to war (I'm 'bout to)\nAnd I don't know if I'ma see you again\nUgh, switch it up\n\n[Verse 2: Tyler, The Creator]\nI said, okay, okay, okay, okie dokie, my infatuation\nIs translatin' to another form of what you call it? (Love)\nOh yeah, oh yeah, oh yeah, I ain't met you\nI've been looking, stop the waiting\n'Fore I stop the chasing, like an alcoholic\n\"You don't understand me\", what the fuck do you mean?\nIt's them rose-tinted cheeks, yeah it's them dirt-colored eyes\nSugar honey iced tea, bumblebee on the scene\nYeah, I'd give up my bakery to have a piece of your pie\nUugh!\n\n[Pre-Chorus: Tyler, The Creator]\n20/20, 20/20 vision\nCupid hit me, cupid hit me with precision, I\nWonder if you look both ways\nWhen you cross my mind\nI said, I said\nI'm sick of, sick of, sick of, sick of chasing\nYou're the one that's always running through my day dreams, I\nI can only see your face when I close my eyes\n(So)\n\n[Chorus: Kali Uchis]\nCan I get a kiss? (Can I get a kiss?)\nAnd can you make it last forever? (Make it last forever)\nI said I'm 'bout to go to war ('Bout to go to war)\nI don't know if I'ma see you again (See you again)\nCan I get a kiss? (Can I?)\nAnd can you make it last forever? (Can you?)\nI said I'm 'bout to go to war ('Bout to)\nAnd I don't know if I'ma see you again\n\n[Outro: Tyler, The Creator & Kali Uchis]\nOkay, okay, okay, okay\nOkay, okay, okay, oh\nLa la, la la la la, la la\nLa la, la la la, la la\nOkay, okay, okay, okay\nOkay, okay, okay, oh\nLa la, la la la la, la la\nLa la, la la la la\nOne more time?"
    },
    {
        "Title": " Brown Skin Lady",
        "Artist": "Black Star",
        "Year": " (1998)",
        "Lyrics": "[Sample: Chameleon Street]\nSmooth: You got that good hair too\nWilliam Douglas Street: You like what?\nSmooth: I like girls with that light complexion on them\nStreet: You're a moron\nSmooth: I can't help it\nStreet: What? Being a moron\nSmooth: Yeah that too\nStreet: You're the first one out there with a dashiki talking that crap\nSmooth: I'm a victim -\nStreet: \"Good hair.\" Nigga you so brainwashed\nSmooth: I'm a victim brother\nStreet: You're a 'victim'\nSmooth: I'm a victim of 400 years of conditioning\nStreet: Shut up\nSmooth: The Man has programmed my conditioning\nStreet: Mhm\nSmooth: Even my conditioning has been conditioned\n\n[Intro: Talib Kweli & Mos Def]\nBut most of yall brothers\nCame from your mothers\nLooking all sweet (Black Star keep shining)\nAnd be like yo, let me ask you somethin\nI wanna know, I wanna know who you are\n\n[Chorus: Mos Def & Talib Kweli]\nBrown skin lady, hey hey\nYes\nWhere you goin'\nThis goes to the brown skin ladies yo\nBrown skin lady\nIndigenous women of the planet Earth\nWhat you doin?\nGivin' birth to the brown skin ladies first\nBrown skin lady\nFor what it's worth, from me to you\nHow do you feel?\nFrom me to you, watchin' you\n\n[Bridge: Mos Def & Talib Kweli]\nI like the way you walk, when you walk on by\nI like the, I like the, I like the, I like the way you walk\nI like the way you move, when you do that dance\nYes, I like the way you move\nI like the way you walk, when you walk on by\nI like the, I like the, I like the, I like the way you walk\nI like the way you move, when you do that dance\nPlease, won't you do that dance\n\n[Mos Def & Talib Kweli]\nAnd everybody on the avenue I know, when they see her say\nEverybody on the avenue I know, when they see her say\nThere she is\n\n[Verse 1: Talib Kweli]\nFresher than Tony Rebel's vegetables at African street festivals\nWhere incredible women is, plentiful\nOver the years I met a few, none of them compare to you\nPreparing you to make fruit bearable, somethin terrible, let's see:\nYou fruitful, beautiful, smart, lovable, huggable\nDoable like art, suitable to be part\nOf my life, Coppertone owe you copyright infringement, pay\nYou been this tan since way back in the day\nIt's like I'm standin there you know appreciatin God's design\nAnd then you showed up, it's like you read my mind\nDAMN SHE'S FINE, I think I add the R-E, in front of that\nAnd see if she D, to get, with a cat like me\n\n[Bridge: Mos Def & Talib Kweli]\nI like the way you walk, when you walk on by\nI like the, I like the, I like the, I like the way you walk\nI like the way you move, when you do that dance\nYes, I like the way you move\nI like the way you walk, when you walk on by\nI like the, I like the, I like the, I like the way you walk\nI like the way you move, when you do that dance\nPlease, won't you do that dance\n\n[Refrain: Mos Def]\nAnd everybody on the avenue I know, when they see her say\nEverybody on the avenue I know, when they see her say\nThere she is\n\n[Verse 2: Mos Def]\nOoooh! Damn baby girl, look at you!\nComin on the block lookin fresh and brand new\nOoooh! Headwrap cover your hairdo\nPretty feet peekin through open-toed shoe\nOoooh! No limit to what I would do\nMake love to you like long interview\nWhooh! Is she for real, me like you\nGood look champion, win the title\nTrue, many man try invite you\nShot down lyric each time they cyph' you\nJewel, what man, ya get born inside zoo?\nFeet they walk way and just let she pass through\nOoooh! Can't be a next one like you\nFamous like tapes made by DJ Clue\nI tighten up my game as I approach you\nYo check her she the nectar the bee get close to\n\n[Instrumental Break]\n\n[Verse 3: Talib Kweli]\nI don't get many compliments, but I am confident\nUsed to have a complex about, gettin too complex\nYou got me, willin to try, looked me in the eye\nMy head is still in the sky, since you walked on by\nI'm feelin high, got my imagination flickerin like hot flames\nIt's how it seems, you make me wanna ride the Coltrane to A Love Supreme\nMy brown lady, creates environments, for\nHappy brown babies, I know it sounds crazy\nBut your skin's the inspiration for cocoa butter\nYou provoke a brother we should get to know one another\nI discover when I bring you through my people say TRUE\nAll I can say, Is all praise due I thank you God for a beauty like you\n\n[Chorus: Mos Def & Talib Kweli]\nBrown skin lady, hey hey\nYes\nWhere you goin'\nThis goes to the brown skin ladies yo\nBrown skin lady\nIndigenous women of the planet Earth\nWhat you doin?\nGivin' birth to the brown skin ladies first\nBrown skin lady\nFor what it's worth, from me to you\nHow do you feel?\nFrom me to you, watchin' you\n\n[Bridge: Mos Def & Talib Kweli]\nI like the way you walk, when you walk on by\nI like the, I like the, I like the, I like the way you walk\nI like the way you move, when you do that dance\nYes, I like the way you move\nI like the way you walk, when you walk on by\nI like the, I like the, I like the, I like the way you walk\nI like the way you move, when you do that dance\nPlease, won't you do that dance\n\n[Refrain: Mos Def]\nAnd everybody on the avenue I know, when they see her say\nEverybody on the avenue I know, when they see her say\nThere she is\n\n[Outro: Mos Def]\nShe's a brown skinned lady\nSuch a brown skinned lady\nShe's a brown skinned lady\nShe's a brown skinned lady\nShe's a brown skinned lady\nShe's a brown skinned lady\n\n[Outro: Talib Kweli]\nBaby, what you mean you don't think you look good?\nYou know what some people put themselves through\nTo look just like you?\nDark stocking, high heels, lipstick, alla that\nYou know what?\nWithout makeup you're beautiful\nWhatcha you need to paint the next face for\nWe're not dealin with the European standard of beauty tonight\nTurn off the TV, put the magazine away\nIn the mirror tell me what you see\nSee the evidence of divine presence\nWomen in the, Caribbean, they got the, golden sun\nI know women on the continent got it\nNigeria and Ghana, you know they got it\nTanzania, Zambia and Mozambique\nAnd Botswana, to let it speak\nHow 'bout Latinas, Colombianas\nCubanas, Dominicanas, Tahinians\nOf course the Brooklyn women walk that walk\nAnd the Bronx women walk that walk\nHonies from Queens walk that walk\nNYC, ATL, LA, Cincinnati, the Bay Area\nGot the cocoa butter brown skinned ladies doing their thing in\nLondon and Paris, cocoa butter brown sk..."
    },
    {
        "Title": " Teenage Love",
        "Artist": "Slick Rick",
        "Year": " (1988)",
        "Lyrics": "[Hook]\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\n\n[Verse 1]\nHey sport, here's a thought from the old school crew\nA serious situation we all go through\nIt deals with your feelings, so hear what I say\nIt's like a day where nothing seems to go your way\nBust this, two people, they really like each other\nHe says there's no one else and she claims there is no other\nThe feelings are same, and you receive a notion\nTo reveal your inner thoughts and deeply hid emotions\n\n[Hook]\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\n\n[Verse 2]\nPrecious times, hoping they won't end\nTell your mother 'bout your lover, also your best friend\nYa mighty proud while you're holding her hand\nBoys, yo that's my woman, and girls, yeah that's my man\nThis person brings a certain warmth to ya heart\nAnd everything seems so great at the start\nFor she loves him, and he also loves her\nAnd it's hard to turn back to who the person you were\nBut later on, problems start to occur\nAnd the bond, which combines y'all turn into a blur\nFor the feelings were the same, now here's the score\nYou love 'em too much, and they don't love you anymore\nDue to your attitude, a number or because you're not being true\nOr maybe they're just plain sick of seeing you\nWord, now it might seem strange\nYou better take hints quick, and make the right change\n\n[Hook]\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\n\n[Verse 3]\nSee just when you swore, the ball was rolling\nThey're gone, and part of your heart's been stolen\nGet back on your feet, with a hop and a skip\nBut no, you'd rather go with this dead relationship\nHanging around, and buying him stuff\nYou seem him every darn day, you don't see him enough\nYou follow them around, and they claim ya hawking\nWhen conversation comes, you do all the talking\nNot to mention, attention, we all need a bit\nBehind your back they're saying, yeah he's all on my...\nThey're getting sick of you, and quite annoyed\nAnd if you had plans for the future, they're now destroyed\nYou saw what was happening, and you still let it\nAnd if you ever let him make love to ya girl, you can forget it\nSweetheart, you been caught\nIt'll spread around town faster than ya thought\nAnd break up time, and you receive the words\nYo, this is from the heart, and I know the part hurts\nGet over it, from now don't take short slick\nIf it's not true love, you shouldn't deal with it\nJust think of your future, and what is to come\nAnd pay attention to the words that's in this song, they go\n\"Don't hurt me again\nDon't, don't, don't hurt me again\"\n\n[Bridge]\n\"Do you know where ya goin' to\nDo like the things that life is showin' you\nAnd are you going to\nDo you know?\"\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\n\n[Hook]\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again\nA teenage love, a teenage love\nDon't, don't hurt me again\nDon't, don't, don't hurt me again"
    },
    {
        "Title": " Beautiful Skin",
        "Artist": "Goodie Mob",
        "Year": " (1998)",
        "Lyrics": "[Cee-Lo]\nMmmm.. this particular song right here is..\nDedicated to the black woman\nAnd it doesn't pertain to all black women\nBecause some of y'all disrespect y'allself\nBecause you don't know who you are in the first place\nThis is out of common respect, for all women period\nWord up, like this song, yo\n\n[Verse 1: Cee-Lo]\nYo, I'm quite single, and occassionally I mingle\nBut aside from all the rest, she sparks my interest\nNo, ma'am, I don't know you\nJust offering the common respect I feel I owe you\nAlso, some conversation, companionship, common-ground and common-sense\nThere's no such thing as coincidence in, me finding you here\nAnd I really hate screaming in your ear, so some other time, OK?\nI waited a day *phone rings* Hello?\nThis is Carlito from a couple of days ago, you sound tired\nForgive me if I've called you too late\nBut what better time to relate mind-state? Where could I begin?\nHasn't anyone ever told you you got beautiful skin?\nYou're more than welcome, what do you desire within?\nI just, wanna be, there's no need to put titles on you and me\nThose are limitations, living and learning are our only obligations\nEquality, honesty, independence, intelligence, emotion and devotion\nHumbly seeking to hear God when he's speaking\nAt one time, my mind, just, couldn't conceive\nA woman had to dress a certain way to believe\nBut, in the same breath, a-llow me to say\nThat, if you believed young lady, you wouldn't dress that way\nAnd I, was attracted to your class, I couldn't see all yo' ass\nAnd, I was very content, and you deserved every complement\nNow, remember our indifferences make us the same\nYou gotta have some game, or, many of you\nWon't even be able to take care of yourself, uh\nAnd Love, when I look at you, I see my reflection\nSo I offer my love, affection and protection\nShawty, you dead fine, but the bottom-line is\nYou're still my sister\n\nChorus: Cee-Lo *singing*\n\nWell, I say you're my, beginnin my end\nYou're my sista lover and friend\nGod is, your light from within\nIt shines through your beautiful skin\nWhat they, say bout you ain't true\nThere's no me if there is no you\nI hope, that you understand\nYou got to respect yourself before I can\n\n[Verse 2: Big Gipp]\nYeah, I met you and y'all knew, saw you again on Marietta\nDowntown Atlanta, checkin your long legs, got me smirkin\nFixed me dinner one night, candles lit\nKinda thought you was slick in the beginnin'\nBut it teurned out you wouldn't lie\nLooked me in my eye, I listened\nSucked it up, pushed on, we made amends, both sides clicked\nTrue friends, since then, years done gon by\nBrought a baby girl into this world, made our parents grandfolks\nHousehold with no hope, took care of ye, you me\nWhen shit got put out on the curb\nCloser than the skin on the back of my hand\nThrough the thick and thin, we can win\nBeautiful black skin\n\nChorus\n\n[Verse 3: Khujo]\nNo need to compete, with the music loud\nOr stairs cold, put on a scale, of one to ten, you a twelve\nI chose, her over jail and hell\nOriginally from ATL\n\n[Verse 4: T-Mo]\nCompatible souls come together, under bad weather\nTo discuss distrust amongst the so-called\nGood in every wo-man, how I wish this was true\nI deal with facts only, already done cloned me\nWhy I sang the blues, when there's only one God\nThat watches over our every step, I need his help\nWhen I'm walkin, lookin for the right female\nI can't tell sometimes\nThey tell me the devil's comin humble in his approach\nSpontaneous with the game\nHe caught the naive of a girl fallin for the OK\nLet the pistol smoke the one you live by\nDie by, examples of how relationships can be\n\n[Verse 5: Khujo]\nI rolls the dice, takin a chance at crappin out\nLike today boy, I lost one of my best hips\nNatural thick lips, no animal fat implants\nWide load, just started workin at the airport\n19 years old, worth more than her weight in gold\nBut it was all my fault, so don't cry, understand\nIf down the line I want you back and the feelin ain't mutual\nJust promise me you'll find a new man -- that's bout some business\nHope she find what her was lookin for, like a dreamto my end\nI wanted to be more than friends\nBeautiful black skin (black skin)\n\nChorus: repeat to end"
    },
    {
        "Title": " Super Bass",
        "Artist": "Nicki Minaj",
        "Year": " (2010)",
        "Lyrics": "[Verse 1: Nicki Minaj]\nThis one is for the boys with the booming system\nTop down, AC with the cooler system\nWhen he come up in the club, he be blazin' up\nGot stacks on deck like he savin' up\nAnd he ill, he real, he might gotta deal\nHe pop bottles and he got the right kind of build\nHe cold, he dope, he might sell coke\nHe always in the air, but he never fly coach\nHe a muthafuckin trip, trip, sailor of the ship, ship\nWhen he make it drip, drip, kiss him on the lip, lip\nThat's the kinda dude I was lookin' for\nAnd yes, you'll get slapped if you're lookin', ho\nI said, excuse me you're a hell of a guy\nI mean my, my, my, my you're like pelican fly\nI mean, you're so shy and I'm loving your tie\nYou're like slicker than the guy with the thing on his eye, oh\n\n[Refrain: Nicki Minaj]\nYes I did, yes I did\nSomebody please tell em who the eff I is\nI am Nicki Minaj, I mack them dudes up\nBack coupes up, and chuck the deuce up\n\n[Chorus: Nicki Minaj & Ester Dean]\nBoy, you got my heartbeat running away\nBeating like a drum and it's coming your way\nCan't you hear that boom, badoom, boom, boom, badoom, boom, bass?\nHe got that super bass\nBoom, badoom, boom, boom, badoom, boom, bass\nYeah, that's that super bass\nBoom, boom, boom, boom\nBoom, badoom, boom, boom, badoom, boom, bass \nHe got that super bass\nBoom, badoom, boom, boom, badoom, boom, bass \nYeah, that's that super bass\n\n[Verse 2: Nicki Minaj]\nYo, yo\nThis one is for the boys in the polos\nEntrepreneur niggas and the moguls\nHe could ball with the crew, he could solo\nBut I think I like him better when he dolo\nAnd I think I like him better with the fitted cap on\nHe ain't even gotta try to put the mack on\nHe just gotta give me that look, when he give me that look\nThen the panties comin' off, off, uh\nExcuse me, you're a hell of a guy\nYou know, I really got a thing for American guys\nI mean, sigh, sickenin' eyes\nI can tell that you're in touch with your feminine side, uh\n\n[Refrain: Nicki Minaj]\nYes I did, yes I did\nSomebody please tell him who the eff I is\nI am Nicki Minaj, I mack them dudes up, back coupes up, and chuck the deuce up\n\n[Chorus: Nicki Minaj & Ester Dean]\nBoy, you got my heartbeat running away\nBeating like a drum and it's coming your way\nCan't you hear that boom, badoom, boom, boom, badoom, boom, bass?\nHe got that super bass\nBoom, badoom, boom, boom, badoom, boom, bass\nYeah, that's that super bass\nBoom, boom, boom, boom...\nBoom, badoom, boom, boom, badoom, boom, bass \nHe got that super bass\nBoom, badoom, boom, boom, badoom, boom, bass\nYeah, that's that super bass\n\n[Bridge: Nicki Minaj]\nSee, I need you in my life for me to stay\nNo, no, no, no, no I know you'll stay\nNo, no, no, no, no, don't go away\nBoy, you got my heartbeat runnin' away\nDon't you hear that heartbeat comin' your way?\nOh, it be like, boom, badoom, boom, boom, badoom, boom, bass\nCan't you hear that boom, badoom, boom, boom, badoom, boom, bass?\n\n[Chorus: Nicki Minaj & Ester Dean]\nBoy, you got my heartbeat running away\nBeating like a drum and it's coming your way\nCan't you hear that boom, badoom, boom, boom, badoom, boom, bass?\nHe got that super bass\nBoom, badoom, boom, boom, badoom, boom, bass\nYeah, that's that super bass\nBoom, boom, boom, boom...\nBoom, badoom, boom, boom, badoom, boom, bass\nHe got that super bass\nBoom, badoom, boom, boom, badoom, boom, bass \nYeah, that's that super bass"
    },
    {
        "Title": " How's It Goin' Down",
        "Artist": "DMX",
        "Year": " (1998)",
        "Lyrics": "[Phone rings]\n\nGuy: Whose dick you sucking?\nGirl: Don't call me with that bullshit, alright?\nGuy: You lying, you lying to me, B\nGirl: Yeah, exactly\nGuy: Whose dick you sucking? C'mon B, I just heard some shit about you, some foul shit. The fuck is the deal?\nGirl: Suck my fucking dick, you bitch-ass nigga! I don't\nGuy: No, you explain it to me, bitch. You know what I'm talking about\nGirl: I don't know nobody up here! I don't fuck with nobody up here and I ain't been fucking with nobody up here! I don't know nobody in fucking Yonkers!\nGuy: Lying-ass bitch. You ain't shit. Do I got to holler his name too?\nGirl: Who the fuck is he!?\nGuy: Bitch, you fuckin' him!\n\n[Hangs up]\n\n[Chorus: DMX and (Faith Evans)]\nWhat type of games is bein' played, how's it goin' down?\n(All I want is you)\nIt's on 'til it's gone, then I gots to know now\n(All I want)\nIs you with me or what? Think I'm trying to get me a nut\n(All I want is you)\nJust 'cause honeys wanna give me the butt, what\n(All I want is you)\nWhat type of games is bein' played, how's it goin' down?\n(All I want is you)\nIt's on 'til it's gone, then I gots to know now\n(All I want)\nIs you with me or what? Think I'm trying to get me a nut\n(All I want is you)\nJust 'cause honeys wanna give me the butt, what\n(All I want is you)\n\n[Verse 1]\nI'm politickin' with this chicken, wonderin' if I'ma creep her\nLittle hoodrat bitch from 25th named Tenika\nComin' through, like I do, you know, gettin' my bark on\nKnew she was a thug 'cause when I met her she had a scarf on\n5411, size 7 in girls\nBabyface, would look like she was 11 with curls\nGirlfriend, remember me (what?) from way back?\nI'm the same cat with the wave cap\nThat motherfucker that TNT used to blaze at\nStill here, so it's all good\nOh, you know my niggas Rich and them\nDoin' they thing on 35th? Damn, it's a small hood\nAnd it's all wood, so let me get that number, I get up\nAight? Hit you on the jack later on, see whassup\nTalkin' to shorty made me wanna do somethin' nice\nLookin' at that ass made me wanna do somethin' tonight\nAnd I know right when I see right, shorty lookin' like she tight\nShe bite, better give a nigga the green light, we might…\n\n[Chorus: DMX and (Faith Evans)]\nWhat type of games is bein' played, how's it goin' down?\n(All I want is you)\nIt's on 'til it's gone, then I gots to know now\n(All I want)\nIs you with me or what? Think I'm trying to get me a nut\n(All I want is you)\nJust 'cause honeys wanna give me the butt, what\n(All I want is you)\nWhat type of games is bein' played, how's it goin' down?\n(All I want is you)\nIt's on 'til it's gone, then I gots to know now\n(All I want)\nIs you with me or what? Think I'm trying to get me a nut\n(All I want is you)\nJust 'cause honeys wanna give me the butt, what\n(All I want is you)\n\n[Verse 2]\nI'm gettin' at shorty like, \"What you need? What you want?\"\nWant for nothin', 'cause I got you, but you front?\nI see you with your baby father, but it don't matter\nSince you gave me the pussy, that ass is gettin' fatter\nLet that nigga play daddy, make moves with me\nI'da kept it more than real boo, can't lose with me (true)\nHeard he smacked you\n'Cause you said my name while y'all was sexin'\nRan up on this cat he thought was me and started flexin'\nYou know I ain't even with that\nSo he gon' have to get that just on GP\nTry to creep me (what?), leave that nigga sleepy\nOn the strength of you, that's your kids daddy\nI ain't gon' send him on his way, put him up in that big Caddy\nBut let him know, never mind, yo, I need you to go\nTake this snow up to 1-5-0, see Joe\nGet that, come back with that, we can split that, sit back\nFuck, puff a L, forget that; you with that?\n\n[Chorus: DMX and (Faith Evans)]\nWhat type of games is bein' played, how's it goin' down?\n(All I want is you)\nIt's on 'til it's gone, then I gots to know now\n(All I want)\nIs you with me or what? Think I'm trying to get me a nut\n(All I want is you)\nJust 'cause honeys wanna give me the butt, what\n(All I want is you)\nWhat type of games is bein' played, how's it goin' down?\n(All I want is you)\nIt's on 'til it's gone, then I gots to know now\n(All I want)\nIs you with me or what? Think I'm trying to get me a nut\n(All I want is you)\nJust 'cause honeys wanna give me the butt, what\n(All I want is you)\n\n[Verse 3]\nAyo, this chicken got me diggin' her moves, 'cause she smooth\nWin or lose, whoever she choose, get's the dues\nRespect is not expected, but it's given 'cause it's real\nBeing neglected's the norm, expected, the deal\nLie, cheat, and steal for me\nPuttin' somethin' in a nigga's wig if you squeal for me\nKill for me, you're still with me?\n'Cause we get down like what\nTold you's from the door, it ain't all about a nut\nI'm gon' be fair, tryin' to be there, we gon' see then\nHit me with the question, boo, that answer gon' be \"yeah\"\nSee there, somethin' can go wrong, it does\nLoved it, let it go, and it came back, that's how strong it was\nBut she belonged to cuz, couldn't belong to me\nShe had two kids by this nigga, it was wrong for me\nBut we gon' always be best of friends, haha\nMad love, boo, to the end, tada\n\n[Chorus: DMX and (Faith Evans)]\nWhat type of games is bein' played, how's it goin' down?\n(All I want is you)\nIt's on 'til it's gone, then I gots to know now\n(All I want)\nIs you with me or what? Think I'm trying to get me a nut\n(All I want is you)\nJust 'cause honeys wanna give me the butt, what\n(All I want is you)\nWhat type of games is bein' played, how's it goin' down?\n(All I want is you)\nIt's on 'til it's gone, then I gots to know now\n(All I want)\nIs you with me or what? Think I'm trying to get me a nut\n(All I want is you)\nJust 'cause honeys wanna give me the butt, what\n(All I want is you)\nWhat type of games is bein' played, how's it goin' down?\n(All I want is you)\nIt's on 'til it's gone, then I gots to know now\n(All I want)\nIs you with me or what? Think I'm trying to get me a nut\n(All I want is you)\nJust 'cause honeys wanna give me the butt, what\n(All I want is you)\nWhat type of games is bein' played, how's it goin' down?\n(All I want is you)\nIt's on 'til it's gone, then I gots to know now\n(All I want)\nIs you with me or what? Think I'm trying to get me a nut\n(All I want is you)\nJust 'cause honeys wanna give me the butt, what, uhh...\n(All I want is you)\n\n[Outro: Faith Evans]\nAll I want..."
    },
    {
        "Title": " Put It On Me",
        "Artist": "Ja Rule ",
        "Year": " (2000)",
        "Lyrics": "[Intro: Ja Rule]\nWhere would I be without you?\n\n[Chorus: Ja Rule]\nWhere would I be without my baby?\nThe thought alone might break me\nAnd I don't wanna go crazy\nBut every thug needs a lady\n\n[Verse 1: Ja Rule]\nGirl, it feel like you and I been mourning together\nInseparable, we chose pain over pleasure\nFor that you'll forever be a, part of me\nMind, body and soul ain't no I in we (baby)\nWhen you cry who wipes your tears\nWhen you scared, who's telling you there's nothin' to fear\nGirl, I'll always be there\nWhen you need a shoulder to lean on\nNever hesitate knowing you can call on, your soul-mate\nAnd vice versa, that's why I be the first to\nSee Jacob's and frost your wrist up\nNow you owe me, I know you're tired of being lonely\nSo baby girl, put it on me\n\n[Chorus: Ja Rule]\nWhere would I be without you? (Uh)\nI only think about you (yeah)\nI know you're tired of being lonely (lonely)\nSo baby girl, put it on me (put it on me)\nWhere would I be without you? (Uh)\nI only think about you (yeah)\nI know you're tired of being lonely (lonely)\nSo baby girl, put it on me (put it on me)\n\n[Verse 2: Vita]\nYo, and I appreciate the rocks and gifts that you cop me, baby\nAnd that house on the hill when you drop like 80\nOn a down payment thinking damn ain't life gravy\nAnd ever since for my honey I been twice the lady\nWhat would I do without the nights that you kept me warm\nWhen this cold world had a girl caught in a storm\nAnd I accept when you riff when you caught in the wrong\nAnd respect when you flip, cause our love is strong\nAnd when you hit the block, I watch for 10-4\nAnd when my pops asleep you snuck in the backdoor\nBaby boy we been down since junior high\nSo when life get hot in July it's the world against you and I\nWe ballin', tied together and never\nHeart from the heart, knew that it would last forever\nWhen you told me, you would never leave me lonely\nSo baby boy put it on me\n\n[Chorus: Ja Rule]\nWhere would I be without you? (Uh)\nI only think about you (yeah)\nI know you're tired of being lonely (lonely)\nSo baby girl, put it on me (put it on me)\nWhere would I be without you? (Uh)\nI only think about you (yeah)\nI know you're tired of being lonely (lonely)\nSo baby girl, put it on me (put it on me)\n\n[Verse 3: Ja Rule]\nSince we met it's been you and I\nA tear for a tear, baby eye for an eye\nAnd you know that my heart gon cry\nIf you leave me lonely\n'Cause you not just my love you my homie\nWho's gonna console me, my love\nI'm outta control hold me, my love\n'Cause I'm yours\nAnd I don't wanna do nothin' to hurt my baby girl\nIf this was our world it'd be all yours, baby\nThe thought alone might break me\nAnd I don't wanna go crazy\nCause every thug needs a lady (yeah, yeah)\nI feel you baby cause them eyes ain't lying\nWash away all the tears there be no more crying (baby)\nAnd you complete me, and I would die if you ain't wit me\nSo baby girl put it on me\n\n[Chorus: Ja Rule]\nWhere would I be without you? (Uh)\nI only think about you (yeah)\nI know you're tired of being lonely (lonely)\nSo baby girl, put it on me (put it on me)\nWhere would I be without you? (Uh)\nI only think about you (yeah)\nI know you're tired of being lonely (lonely)\nSo baby girl, put it on me (put it on me)\nWhere would I be without you? (Uh)\nI only think about you (yeah)\nI know you're tired of being lonely (lonely)\nSo baby girl, put it on me (put it on me)\nWhere would I be without you? (Uh)\nI only think about you (yeah)\nI know you're tired of being lonely (lonely)\nSo baby girl, put it on me (put it on me)"
    },
    {
        "Title": " Honeydips in Gotham",
        "Artist": "Boogiemonsters",
        "Year": " (1994)",
        "Lyrics": "[Hook] [x4]\nHoneydips in Gotham\nHoneydips in Gotham\nRepresent\n\n[Verse One] [Vex]\nTwelve O'clock on my block on a hot summer's day\nAsiatic dragonfly's passin' by my way\nSister Africa with oriental eyes here she come\nEbony rose from the Earth gettin' darker in the sun\nCocomo complexion brown sugar with the smile\nSun showers to the knees love flower by the Nile\nPeace be a cote du jour  the love survive\nCoolin' in the park after dark with the tribe\nAww yeah\nCheck out all the honeydips in Gotham\nAww yeah\nChillin' with the deadlock crew\nAww yeah\nRespect to every black woman I'm\nStandin' on the street watchin' you\nTrue\nYou know how we do\nChillin' in the aura effervescence just me and you\nOut in Gotham, baby you fine\nI think that I'm losin' my miiiiiiind\n\n[Hook] [x4]\nHoneydips in Gotham\nHoneydips in Gotham\nRepresent\n\n[Verse Two] [Mondo]\nA strong black complexion\nYou draw me like a magnet when you smilin'\nYou check me cause I made it, might you be from the Island?\nThe eye of the beholder couldn't handle you, you're precious\nPardon me my man as I address this\nHoneydip I'm clockin'\nRight on time here comes the perspiration\nI'm not the man, she has an aura of intimidation\nIf I can know you name perhaps tomorrow we can grow\nYour eyes don't lie, I'd be a great African hero\nHe who breaks the barrier will be the one's successor\nI'm claimin' you my cheese because I'm fresher\nAt night I pray to God, we'll walk the path of righteousness together\nNatural potent, my dip don't be smokin'\nPatience is a virtue so I wait around for you\nHoneydip in Gotham, I know there's but a few\nGive me a day in the life of you, you smile with contemplation\nStartin' off the evenin' with some pure conversation\n\n[Hook] [x4]\nHoneydips in Gotham\nHoneydips in Gotham\nRepresent\n\n[Verse Three] [Vex]\nAll the lovely ones, bounce on the one\nSwitch on the two with the sister next to you\nNow bounce with a new brother and rock with your crew\nHoneydips represent, aiight\nThis is how we do\nCoco butter brown sugar makes the underwater chocolate\nSpecial dedication to the sisters come to rock it\nThe mind makes you fine so money can't buy it\nAll the ugly sister's be quiet\n\n[Mondo]\nConversation is on the up rise\nNot ended until dusk\nWhen we're tired and are arms wrapped will make Egyptian\nMust niggas get mad? When they see the honeydip and me\nIn Mocodo shorts, but we know who niggas wanna be\nFlyin' through the galaxy, you'll be the star beside of me\nThe temple of the energy\nThe sister and I miss ya, when you're with me\nYour my sweet and sexy thang\nYou're a honeydip to me!\n\n[Hook] [x4]\nHoneydips in Gotham\nHoneydips in Gotham\nRepresent"
    },
    {
        "Title": " Receipt",
        "Artist": "Lil Wayne",
        "Year": " (2005)",
        "Lyrics": "[Intro]\nIt's kinda hard saying this shit to your face\nSo I do it over snares and bass\nMusic take me away\n\n[Hook]\n(I got to hold on, hold on to my receipt\nYeah, to redeem your love, that's exactly what I need)\n\n[Verse 1]\nYoung broad\nI know you love me like you never loved\nYou know you couldn't find a better thug\nAnd, uh\nYou been peepin' me since I was younger\nSo young\nThat you even called me your little brother\nBut I'm all grown up now\nI got my own money\nI'm married and divorced\nAnd my daughter is a woman\nAnd guess what?\nMy daughter want another\nSister or brother\nAnd you lookin' like a mother\nI took you from a clubber to a lover\nAnd you took another bitch husband\nThe other bitch wasn't\nDoing shit for him\nShe say she did too much\nI say she did nothing\nShe need to quit fronting\nI haven't hid nothing\nAnd you love everything\nCan't hide your feelings\nWon't let my pride conceal it\nYou got Wayne\nI charge it to the game\nAnd baby you can keep the change\nBut—\n\n[Hook]\n(I got to hold on, hold on to my receipt\nYeah, to redeem your love, that's exactly what I need)\nIt's kinda hard saying this shit to your face\nSo I do it over snares and bass\nMusic take me away\n\n[Verse 2]\nDestiny Child CD\nSong number three\nShe cater to me\n'Til we fall asleep\nThen we wake up\nAnd we pick up where we started\nThen she make a nigga breakfast\nSprite, orange juice, and water\nAnd she on stage\nWaiting for me after my show\nSo no time for groupies\nStraight to the top floor\nFresh out the shower\nA smile and a towel\nThen after an hour\nShe gon' need another shower\nWhen I'm at home\nIn my coupe\nOr in the office\nOr the streets of The Boot\nI'm thinking 'bout you\nAnd most of the girls that come by are cute\nAnd they try to holla, but they all on mute\nAnd my old girls turn they face up at me\nYeah, they throw they purses and they makeup at me\n'Cause you got Wayne\nI charge it to the game\nAnd baby you can keep the change\nBut—\n\n[Hook]\n(I got to hold on, hold on to my receipt\nYeah, to redeem your love, that's exactly what I need)\nIt's kinda hard saying this shit to your face\nSo I do it over snares and bass\nMusic take me away\n\n[Verse 3]\nCome home\nSmell the food on the stove\nShe done cleaned the whole house\nWashed the dishes and the clothes\nAnd when we out\nWe do it just how we supposed\nLook good for the public\nLeave the drama in the Rolls\nRoyce\nChoice of car that we move in\nShe gets high sometimes\n'Cause I'm always doin' it\nYou hear them hallways\nWe always doin' it\nWork cut\nEvery time feel like the first one\nPerfect\nWhen a nigga stressin' at work\nShe take away all of the pain\nMake it lesser than dirt\nThat's why you got Wayne\nI charge it to the game\nAnd baby you can keep the change\nBut—\n\n[Hook]\n(I got to hold on, hold on to my receipt\nYeah, to redeem your love, that's exactly what I need)\nIt's kinda hard saying this shit to your face\nSo I do it over snares and bass\nMusic take me away\n\n[Outro]\nI got you\nIt's kinda hard saying this shit to your face\nSo I do it over snares and bass\nMusic take her away"
    },
    {
        "Title": " Use Me Up",
        "Artist": "UGK",
        "Year": " (1992)",
        "Lyrics": "[Verse 1: Pimp C]\nI got a girl and she treat me fine\nBut the homies all think that I'm losin my mind\nI'm trippin and I know it cause I'm all nerved up\nCause everytime I go to sleep, I see this big ol' butt\nSee I ain't never gave no chick fo' stars\nBut she treat me so good that she be drivin my car\nAnd everyday it get better, I cain't lie\nWent to the house and she made me some hot potato pie\nAll my friends be sayin, \"She ain't nothin but a scrub\"\nBut she make me feel high like I'm, hooked on drugs\nSo I give her what she need, and what's done is done\nBut I'm a special kind of fool but aiyyo it don't bother me none\nI cain't help myself, I know that I'm trippin\nBut she got it goin on like Kentucky Fried Chicken\nSo everytime she ask me for my, credit card\nYou know she get it cause ya know that... (Chill, C) I know, G\nI used to be the playa, now I'm gettin pimped\nI used to be hard, now I'm livin all limp\nWhy I let her play me? You cain't understand!\nSo sit yourself down and just listen to my man...\n\n[Chorus: Bill Withers sample]\nI-yi-yi-yi-I, wanna spread the news\nThat if it feels this good gettin used\nOh, you can just keep usin me...\nUntil you use me up...\nUntil you use me up...\nUntil you use me up...\nUntil you use me up...\nUntil you use me up...\nUntil you use me up\n\n[Verse 2: Pimp C]\nI been to the mountain top, and down to the valley low\nWent to Austin with 3-2 and STILL ain't find no finer hoe\nNot much no finer girl, but one that treat me so sweet\nRub my back, when I'm so' and cook me somethin good to eat\nShe worked me so hard 'til I, hurt my back\nSo I'm passin out them ducats and them, Kroger sacks\nAnd everybody wonderin why I smile all day\nAll the girls wanna know why I won't give 'em the play\nMy ol' girl called me, axe me why I wanna dis her\nI told her cause her lovin ain't better than her sister\nI can't get enough, the bad got me stuck\nI give her all my money and she always do me up\nBun say I'm trippin out, and Byrd say I'm trippin, too\nBut this time I just can't LISTEN to my whole crew\nCause back in the day, I vowed to never change my pimp game\nBut '92 came around, and thangs go insane\nI gotta get my thang back on track\nBut the mo' I try to stay away, the mo' I comes back\nWhy I let her play me? You can't understand!\nSo sit yourself down and just listen to my man...\n\n[Chorus 2: Bill Withers sampled]\nI-yi-yi-yi-I, said brother, if you only knew\nYou'd wish that you were in my shoes\nYou just keep usin me...\nUntil you use me up...\nUntil you use me up...\nUntil you use me up...\nUntil you use me up...\nUntil you use me up...\nUntil you use me up\n\nI-yi-yi-yi-I, wanna spread the news\nThat if it feels this good gettin used\nOh, you can just keep usin me...\nUntil you use me up...\n\n[Verse 3: Pimp C]\nTo sum it all up, I'm breakin ALL my rules\nCause she got me droppin off her little brother to school\nI be gettin bills, and stubs from checks\nI work all day, just to spend it on sex\nBut all that really matters is I'm happy, dude\nAnd I be happy long as I get good soul food\nUGK sayin peace out, and plenty of luck\nAnd she could keep usin Pimp C - uh, just a use me up!\n\n[Outro: Bill Withers (Pimp C)]\nAh-hah well oh, BA-BY, BA-BY, BA-BY (Yeah, a-just use me up)\nBA-BY, ah-hah well oh (Uh, a-just use me up)\nBA-BY, BA-BY, BA-BY (Yeah, a-just use me up)\nBA-BY, ah-hah well oh (Uh, a-just use me up)\nBA-BY, BA-BY, BA-BY (Yeah, a-just use me up)\nBA-BY, ah-hah well oh (Uh, a-just use me up)\nBA-BY, BA-BY, BA-BY (Yeah, a-just use me up)\nBA-BY, ah-hah well oh (Peace out for '92, in the nine-tres)"
    },
    {
        "Title": " Beautiful",
        "Artist": "Snoop Dogg ",
        "Year": " (2003)",
        "Lyrics": "[Chorus: Pharrell]\nBeautiful, I just want you to know\nYou're my favorite girl\n(Yeah, oh yeah, there's something about you)\nBeautiful, I just want you to know\nYou're my favorite girl\n(Yeah, oh yeah, there's something about you)\n\n[Verse 1: Snoop Dogg]\nI know you gon' lose it, this new Snoop shit\nCome on baby boo, you gots to get into it\nDon't fool with the player with the cool whip\nYeah, yeah, you know I'm always on that cool shit\nWalk to it, do it how you do it\nHave a glass, let me put you in the mood and\nLittle cutie looking like a student\nLong hair with ya big fat booty\nBack in the days, you was a girl I went to school with\nHad to tell your moms and sister to cool it\nThe girl wanna do it, I just might do it\nHit her up with some pimp pimp fluid\nMommy don't worry, I won't abuse it\nHurry up and finish so we can watch Clueless\nI laugh at these niggas when they ask, \"Who do this?\"\nBut everybody know, ooh girl, that you is\n\n[Chorus: Pharrell]\nBeautiful, I just want you to know\nYou're my favorite girl\n(Yeah, oh yeah, there's something about you)\nBeautiful, I just want you to know\nYou're my favorite girl\n(Yeah, oh yeah, there's something about you)\n\n[Verse 2: Snoop Dogg & Pharrell]\nWhen I see my baby boo, shit, I get foolish\nSmack a nigga that tries to pursue it\nHomeboy, she taken, just move it\nI asked you nicely, don't make the Dogg lose it\nWe just blow dro and keep the flow moving\nIn a '64, me and baby boo cruisin'\nBody rag interior blue, and\nHave them hydraulics squeaking when we screwing\nNow she's yelling, hollering out \"Snoop!\" and\nHooting, hollering; hollering, hooting\nBlack and beautiful, you the one I'm choosin'\nHair long, thin, black and curly like you're Cuban\nKeep grooving, that's what we doin'\nAnd we gon' be together until your moms move in\n(Yeah, oh yeah, there's something about you)\n\n[Chorus: Pharrell]\nBeautiful, I just want you to know\nYou're my favorite girl\n(Yeah, oh yeah, there's something about you)\nBeautiful, I just want you to know\nYou're my favorite girl\n(Yeah, oh yeah, there's something about you)\n\n[Bridge: Charlie Wilson & Pharrell]\nSee, I just want you\nTo know that you are really special\n(Yeah, oh yeah, there's something about you)\nOh my, oh my, oh my, oh my\nSee, I just want you\nTo know that you are really special\n(Yeah, oh yeah, there's something about you)\nOh my, oh my, oh my, oh my\n(Yeah, oh yeah, there's something about you)\n\n[Verse 3: Snoop Dogg, (Pharrell)]\nSnoop Dogg Clothing, that's what I'm groomed in\nYou got my pictures on the wall in your room, and\nGirls be complaining you keep me boomin'\nBut girls like that wanna listen to Pat Boone\n(Yeah, oh yeah, there's something about you)\nYou's a college girl, but that don't stop you from doin'\nCome and see the Dogg in a hood near you in\nYou don't ask why I roll with a crew, and\nTwist up my fingers, and wear dark blue and\n(Yeah, oh yeah, there's something about you)\nOn the Eastside, that's the crew I choose\nNothing I do is new to you\nI smack up the world if they rude to you\n'Cause baby girl, you're so beautiful\n\n[Chorus: Pharrell]\nBeautiful, I just want you to know\nYou're my favorite girl\nBeautiful, I just want you to know\nYou're my favorite girl\n\n[Bridge: Charlie Wilson & Pharrell]\nSee, I just want you\nTo know that you are really special\n(Yeah, oh yeah, there's something about you)\nOh my, oh my, oh my, oh my\nSee, I just want you\nTo know that you are really special\n(Yeah, oh yeah, there's something about you)\nOh my, oh my, oh my, oh my\nSee, I just want you\nTo know that you are really special\n(Yeah, oh yeah, there's something about you)\nOh my, oh my, oh my, oh my\nI just want you\nTo know that you are really special\n(Yeah, oh yeah, there's something about you)\nOh my, oh my, oh my, oh my\n\n[Outro: Pharrell]\nEhh... oh yeah, there's something about you... Oh-hooo!\nEhh... oh yeah, there's something about you... Oh-hooo!\nEhh... oh yeah, there's something about you... Oh-hooo!"
    },
    {
        "Title": " Mahogany",
        "Artist": "Eric B. & Rakim",
        "Year": " (1991)",
        "Lyrics": "[Verse 1]\nMe and Eric B was coolin’ at the Palladium\nSeen a all-world cover girl, I said hey lady I’m\nSorry if you’re in a rush - don’t let me hold you up\nOr intervene or interrupt, but\nYou got the look - I wanna get to know you better\nI had to let her know - but yo, I didn’t sweat her\nCause if you would've seen what I was seein'\nAlmost looked Korean, but European\nWhen she spoke, her accent was self-explanatory\nEven her body language told the story\nHer name was Mahogany - twin’s name was Ebony\nI said my name is Ra and this is Eric B\nSince the music was loud, I said let’s take a walk\nSo we could talk and see New York\nShow time didn't start until one o’clock\nBut once I entered your mind I wouldn’t wanna stop\nCaress your thoughts til we was thinking the same\nCalm your nerves, massage your brain\nEach moment's a mineral, poetry’s protein\nVerse is a vitamin, effects like codeine\nSo tell me how you feel and I’ll reveal\nA pill that’ll heal ya pain, ’cause I’m real\nShe musta OD’d ’cause she couldn’t resist\nShe spoke slowly when she told me this, she said\n\n[Hook]\nOver me, she’s goin’ crazy\nShe’ll rub me on my chest and call me Mr. Sexy\nShe said she’d have my kids and help me make my next G\nTell me I ain’t finessed mahogany\n\n[Verse 2]\nSo I prescribed her, something to revive\nAnd surprise her, she’s liver and much more wiser\nFrom the light I shine when my brain cells spark\nConstantly so she can glow in the dark\nAnd soon, you can represent the moon\nAs long as I keep you in tune\nI’ll tell you who you are and why you're here\nTake it in stride ’cause it might take a year\nIt’s funny - how time flies when you're havin’ fun\nWe got close and it was almost one\nShe kissed me slow, but you know how far a kiss can go\nFuck around and miss the show\nSo I told her to hold that thought real tight\nWe can finish where we left off later on tonight\nBack to the scene of the crime on time\nAs they introduced the fiend of a rhyme\nShe stood in the crowd with a birds-eye view of me\nThinking of later on of what she would do to me\nThe back of the room I could see her eyes - gloom\nPatient, but hoping that the show was over soon\nAs the place was ripped in half, she made her way to the front row\nSo I said let’s go\nI packed my mic as they screamed for an encore\nThe speakers were blown, plus my mic was sore\nBesides I got places to go, ladies to see\nAnd she could tell me how crazy she was over me\nWe drove off - she said she liked the way that I performed\nAnd couldn’t wait to get 'soft and warm', I said\n\"I was watching you, watching me\nLooks I received made it hard to MC\"\nI can take a hint, so I knew that she\nWanted my agony agony ag-on-y in her bod-y\nDrove to some sights, then I took her to the condo\nShe was pipin’ hot, but I kept my calm so\nShe asked how come I don’t smile\nI said, everything’s fine, but I’m in a New York state of mind\nAs we reached the kingdom, she said bring some\nChampagne, she’ll entertain then sing some\nSentimental, songs real gentle\nIt hit the spot and you know where it went to\nAs we embraced I felt her heart pumpin’\nI knew she was in the mood for somethin’\nSo I laid on my back and relaxed\nIt wasn’t the Perignon that made her collapse\n\n[Hook]\nOver me, she’s goin’ crazy\nShe’ll rub me on my chest and call me Mr. Sexy\nShe said she’d have my kids and help me make my next G\nTell me I ain’t finessed mahogany\n\n[Produced by Eric B., Rakim, Paul C, and Large Professor]"
    },
    {
        "Title": " 21 Questions",
        "Artist": "50 Cent ",
        "Year": " (2003)",
        "Lyrics": "[Ad-Libs: 50 Cent]\nNew York City\nYou are now rockin'\nWith 50 Cent\nYou gotta love it\n\n[Intro: 50 Cent]\nI just wanna chill and twist the lye\nCatch stunts in my 7-45\nYou drive me crazy, shorty, I\nNeed to see you and feel you next to me\nI provide everything you need, and I\nLike your smile, I don't want to see you cry\nGot some questions that I got to ask\nAnd I hope you can come up with the answers, babe\n\n[Chorus: Nate Dogg]\nGirl, it's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\nGirl, it's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\n\n[Verse 1: 50 Cent]\nIf I fell off tomorrow, would you still love me?\nIf I didn't smell so good, would you still hug me?\nIf I got locked up and sentenced to a quarter century\nCould I count on you to be there to support me mentally?\nIf I went back to a hooptie from a Benz\nWould you poof and disappear like some of my friends?\nIf I was hit and I was hurt, would you be by my side?\nIf it was time to put in work, would you be down to ride?\nI get out and peel a nigga cap, chill and drive\nI'm askin' questions to find out how you feel inside\nIf I ain't rap ‘cause I flip burgers at Burger King\nWould you be ashamed to tell your friends you're feelin' me?\nIn the bed, if I used my tongue, would you like that?\nIf I wrote you a love letter, would you write back?\nNow we can have a little drink, you know, a nightcap\nAnd we could go do what you like, I know you like that\n\n[Chorus: Nate Dogg]\nGirl, it's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\nGirl, it's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\n\n[Verse 2: 50 Cent]\nNow would you leave me if your father found out I was thuggin'?\nDo you believe me when I tell you, you the one I'm lovin'?\nAre you mad ‘cause I'm askin' you 21 questions?\nAre you my soulmate? ‘Cause if so, girl, you a blessing\nDo you trust me enough to tell me your dreams?\nI'm starin' at you, tryna figure how you got in them jeans\nIf I was down, would you say things to make me smile?\nI'll treat you how you want to be treated, just teach me how\nIf I was with some other chick and someone happened to see\nAnd when you asked me about it I said it wasn't me\nWould you believe me? or up and leave me?\nHow deep is our bond if that's all it takes for you to be gone?\nWe only humans, girl, we make mistakes\nTo make it up, I'll do whatever it take\nI love you like a fat kid love cake\nYou know my style, I say anything to make you smile\n\n[Chorus: Nate Dogg]\nGirl, it's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\nGirl, it's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\n\n[Outro: Nate Dogg]\nCould you love me in a Bentley?\nCould you love me on a bus?\nI'll ask 21 questions and they all about us\nCould you love me in a Bentley?\nCould you love me on a bus?\nI'll ask 21 questions and they all about us"
    },
    {
        "Title": " I'll Be There for You",
        "Artist": "Method Man ",
        "Year": " (1995)",
        "Lyrics": "You're all, I need\nTo get by, ahhhhh\nYou're all, I need\nTo get by, ahhhhh\n(Background sample: Notorious B.I.G.)\n[Lie together, cry together, I swear to God I hope we fuckin' die together]\nShorty I'm there for you anytime you need me\nFor real girl, it's me in your world, believe me\nNuttin make a man feel better than a woman\nQueen with a crown that be down for whatever\nThere are few things that's forever, my lady\nWe can make war or make babies\nBack when I was nothin\nYou made a brother feel like he was somethin\nThat's why I'm with you to this day boo no frontin\nEven when the skies were gray\nYou would rub me on my back and say \"Baby it'll be okay\"\nNow that's real to a brother like me baby\nNever ever give my booty away and keep it tight aight\nAnd I'ma walk these dogs so we can live\nIn a phat-ass crib with thousands of kids\nWord life you don't need a ring to be my wife\nJust be there for me and I'ma make sure we\nBe livin in the effin lap of luxury\nI'm realizing that you didn't have to funk wit me\nBut you did, now I'm going all out kid\nAnd I got mad love to give, you my nigga\n\n(Chorus) 2X's\nMary J. Blige\nLike sweet morning dew\nI took one look at you\nAnd it was plain to see\nYou were my destiny\nWith you I'll spend my time\nI'll dedicate my life\nI'll sacrifice for you\nDedicate my life for you\nI got a love jonz for your body and your skin tone\nFive minutes alone I'm already on the bone\nPlus I love the fact you got a mind of your own\nNo need to shop around you got the good stuff at home\nEven if I'm locked up North you in the world\nWrapped in three-fourths of cloth never showin your stuff off, boo\nIt be true me for you that's how it is\nI be your Noah, you be my Wiz\nI'm your Mister, you my Mrs. with hugs and kisses\nValentine cards and birthday wishes? Please\nBe on another level of planning, of understanding\nThe bond between man and woman, and child\nThe highest elevation, cuz we above\nAll that romance crap, just show your love\n\n(Repeat chorus till fade)"
    },
    {
        "Title": " Me & My Bitch",
        "Artist": "The Notorious B.I.G",
        "Year": " (1994)",
        "Lyrics": "[Intro: Notorious B.I.G., Puff Daddy & Girl]\nYo let— let— let me ask you a question, yo\nYo, would you kill for me?\nHmm, yeah\nUh, the act of making love— (Haa)\nWhat took you so long to answer motherfucker?\nI don't know\nThe fuck wrong with you, bitch?\n\n[Verse 1: The Notorious B.I.G.]\nWhen I met you, I admit, my first thoughts was to trick\nYou look so good, huh, I suck on your daddy's dick\nI never felt that way in my life\nIt didn't take long before I made you my wife\nGot no rings and shit, just my main squeeze\nComin' to the crib, even had a set a keys\nDuring the days you helped me bag up my nickels\nIn the process, I admit, I tricked a little\nBut you was my bitch, the one who'd never snitch\nLove me when I'm broke or when I'm filthy fuckin' rich\nAnd I admit, when the time is right, the wine is right\nI treat you right, you talk slick, I beat you right\n\n[Chorus: The Notorious B.I.G., Puff Daddy & Girl]\nJust me and my bitch, me and my bitch\n(But you know you love that ass, don't you?)\nJust me and my bitch, yeah, just me and my bitch\n(Yeah, no question, no question)\nJust me and my bitch, yeah, just me and my bitch, yeah\n(Yo, let me ask you another question)\nJust me and my bitch, just me and my bitch, yeah\n(What?)\nJust me and my bitch, yeah, just me and my bitch, yeah\n(You been fuckin' 'round on me?)\nJust me and my bitch, just me and my bitch\n(Why would I do that?)\nJust me and my bitch, me and my bitch, yeah\n(Yo, don't lie to me, motherfucker)\nJust me and my bitch\n\n[Verse 2: The Notorious B.I.G.]\nMoonlight strolls with the hoes, oh, no, that's not my steelo\nI wanna bitch that like to play ceelo and craps\nPackin' gats in a Coach bag, steamin' dime bags\nA real bitch is all I want, all I ever had\nWith a bop just as strong as me\nTotin' guns just as long as me, the bitch belongs with me\nAny plans with another bitch, my bitch'll spoil it\nOne day, she used my toothbrush to clean the toilet\nThrowin' my clothes out the windows, so when the wind blows\nI see my Polos and Timbos\nHide my car keys so I can't leave\nA real slick bitch, keep a trick up her sleeve\nAnd if I deceive, she won't take it lightly\nShe'll invite me, politely, to fight, G\nAnd then we lie together, cry together\nI swear to God I hope we fuckin' die together\n\n[Chorus: The Notorious B.I.G., Puff Daddy & Girl]\nJust me and my bitch, just me and my bitch, yeah\n(Nigga, nigga, if I ever)\nJust me and my bitch, yeah, just me and my bitch\n(Catch your ass fuckin' around)\nJust me and my bitch, just me and my bitch, yeah\n(I'll cut your motherfuckin' dick off)\nJust me and my bitch, yeah, just me and my bitch\n(Haha)\nJust me and my bitch, just me and my bitch, yeah\n(Stop playin')\nJust me and my bitch, yeah, just me and my bitch\n(I ain't pl— ain't— ain't no jokes, ain't no jokes)\nJust me and my bitch, just me and my bitch, yeah\n(Ain't no jokes)\nJust me and my bitch, yeah, just me and my bitch\n(Yo, don— don't play with my dick)\n\n[Verse 3: The Notorious B.I.G.]\nShe helped me plan out my robberies on my enemies\nDidn't hesitate to squeeze to get my life out of danger\nOne day, she put 911 on the pager\nHad to call back, whether it's minor or major\nNo response, the phone just rung\nGrab my vest, grab my gun, to find out the problem\nWhen I pulled up, police was on the scene\nHad to make the U-turn, make sure my shit was clean\nDrove down the block, stashed the burner in the bushes\nStepped to police with the shoves and the pushes\nIt didn't take long before the tears start\nI saw my bitch dead with the gunshot to the heart\nAnd I know it was meant for me\nI guess the niggas felt they had to kill the closest one to me\nAnd when I find 'em your life is to an end\nThey killed my best friend, me and my bitch\n\n[Chorus: The Notorious B.I.G.]\nJust me and my bitch, me and my bitch, yeah\nJust me and my bitch, yeah, just me and my bitch, uh\nJust me and my bitch, me and my bitch, yeah\nJust me and my bitch, yeah, just me and my bitch, uh\nJust me and my bitch, just me and my bitch, yeah\nJust me and my bitch, just me and my bitch\nJust me and my bitch, me and my bitch, yeah\nJust me and my bitch\n\n[Skit: The Notorious B.I.G. & Girl]\nLet's get started then\nSo when did you first start rappin'?\nUm, I was like about 18 years old. Yeah, about 18\nSo how did you first get started? Who influenced you?\nAin't nobody really influenced me, you know what I'm saying?\nI was just tired of being on the streets, you know what I'm saying? Had to get up off that, you know\nI see. So where you from?\nBrooklyn"
    },
    {
        "Title": " You Got Me",
        "Artist": "The Roots ",
        "Year": " (1999)",
        "Lyrics": "[Chorus: Erykah Badu]\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry, you know that you got me\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry, you know that you got me\n\n[Verse 1: Black Thought]\nSomebody told me that this planet was small\nWe used to live in the same building, on the same floor\nAnd never met before, until I'm overseas on tour\nAnd peeped this Ethiopian queen from Philly takin' classes abroad\nShe studyin' film and photo, flash, focus, record\nSaid she workin' on a flick and could my clique do the score\nShe said she loved my show in Paris at Élysée Montmartre\nAnd that I stepped off the stage and took a piece of her heart\nWe knew from the start that things fall apart and tend to shatter\nShe like, \"That shit don't matter\", when I get home, get at her\nThrough letter, phone, whatever; let's link, let's get together\nShit, you think not, think the Thought went home and forgot?\nTime passed, we back in Philly, now she up in my spot\nTellin' me the things I'm tellin' her is makin' her hot\nStarted buildin' with her constantly 'round-the-clock\nNow she in my world like hip-hop, and keep tellin' me…\n\n[Chorus: Erykah Badu]\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry, you know that you got me\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry, you know that you got me\n\n[Verse 2: Black Thought + Eve]\nYo, I'm the type that's always catching a flight\nAnd sometimes I gotta be out at the height of the night\nAnd that's when she flip and get on some old… \nAnother lonely night\nSeem like I'm on the side, you only lovin' your mic\nI know you gotta get that paper, daddy, keep that shit tight\nBut, yo, I need some sort of love in my life, you dig me?\nWhile politickin' with my sister from New York City\nShe said she know this ball player and he think I'm pretty—psych\nI'm playin', boo, you know it's just with you I'm staying, boo\nAnd when cats be poppin' game, I don't hear what they sayin', boo\nWhen you out there in the world, I'm still your girl\nWith all my classes, I don't have the time for life's thrills\nSo when you sweatin' on stage, think of me when you rhyme\nAnd don't be listenin' to your homies, they be leadin' you blind\nYeah, so what you saying, I can trust you?\nIs you crazy?! You my king for real\nBut sometimes relationships get ill, no doubt\n\n[Chorus: Erykah Badu]\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry, you know that you got me\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry, you know that you got me\n\n[Verse 3: Black Thought]\nThat snake could be that chick and that rat could be that cool cat\nThat's whisperin', \"She tryin' to play you for the fool, Black\"\nIf something's on your chest, then let it be known\nSee, I'm not your every five minutes all on the phone\nAnd on the topic of trust, it's just a matter of fact\nThat people bite back and fracture what's intact\nAnd they'll forever be, I ain't on some \"Oh, I'm a celebrity!\"\nI deal with the real, so if it's artificial, let it be\nI've seen people caught in love like whirlwinds\nListenin' to their squads and listenin' to girlfriends\nThat's exactly the point where their whole world ends\nLies come in, that's where that drama begins, and she like…\n\n[Chorus: Erykah Badu]\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry, you know that you got me\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry, you know that you got me\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry, you know that you got me\nIf you were worried 'bout where\nI been or who I saw or\nWhat club I went to with my homies\nBaby, don't worry, you know that you got me\nIf you were worried 'bout where\nI been or who I saw or..."
    },
    {
        "Title": " I Need Love",
        "Artist": "LL Cool J",
        "Year": " (1987)",
        "Lyrics": "[Verse 1]\nWhen I'm alone in my room sometimes I stare at the wall\nAnd in the back of my mind I hear my conscience call\nTelling me I need a girl who's as sweet as a dove\nFor the first time in my life, I see I need love\nThere I was giggling about the games\nThat I had played with many hearts, and I'm not saying no names\nThen the thought occured, tear drops made my eyes burn\nAs I said to myself, \"look what you've done to her\"\nI can feel it inside, I can't explain how it feels\nAll I know is that I'll never dish another raw deal\nPlaying make-believe pretending that I'm true\nHolding in my laugh as I say that I love you\nSaying amor kissing you on the ear\nWhispering, \"I love you and I'll always be here\"\nAlthough I often reminisce I can't believe that I found\nA desire for true love floating around\nInside my soul because my soul is cold\nOne half of me deserves to be this way 'til I'm old\nBut the other half needs affection and joy\nAnd the warmth that is created by a girl and a boy\n\n[Hook]\nI need love\nI need love\n\n[Verse 2]\nRomance, sheer delight, how sweet?\nI gotta find me a girl to make my life complete\nYou can scratch my back, we'll get cozy and huddle\nI'll lay down my jacket so you can walk over a puddle\nI'll give you a rose, pull out your chair before we eat\nKiss you on the cheek and say, \"ooh girl, you're so sweet\"\nIt's deja vu whenever I'm with you\nI could go on forever telling you what I do\nBut where you at? You're neither here or there\nI swear I can't find you anywhere\nDamn sure you ain't in my closet, or under my rug\nThis love search is really making me bug\nAnd if you know who you are why don't you make yourself seen?\nTake the chance with my love and you'll find out what I mean\nFantasies can run, but they can't hide\nAnd when I find you I'm gon' pour all my love inside\n\n[Hook]\nI need love\nI need love\n\n[Verse 3]\nI wanna kiss you, hold you, never scold, you just love you\nSuck on you neck, caress you and rub you\nGrind, moan and never be alone\nIf you're not standing next to me you're on the phone\nCan't you hear it in my voice? I need love bad\nI've got money, but love's something I've never had\nI need your ruby red lips sweet face and all\nI love you more than a man who's 10 feet tall\nI'd watch the sunrise in your eyes\nWe're so in love when we hug we become paralyzed\nOur bodies explode in ecstasy unreal\nYou're as soft as a pillow and I'm as hard as steel\nIt's like a dream land, I can't lie, I never been there\nMaybe this is an experience that me and you can share\nClean and unsoiled yet sweaty and wet\nI swear to you this is something I'll never forget\n\n[Hook]\nI need love\nI need love\n\n[Verse 4]\nSee what I mean? I've changed, I'm no longer\nA playboy on the run, I need something that's stronger\nFriendship, trust, honor, respect, admiration\nThis whole experience has been such a revelation\nIt's taught me love and how to be a real man\nTo always be considerate and do all I can\nProtect you, you're my lady and you mean so much\nMy body tingles all over from the slightest touch\nOf your hand and understand I'll be frozen in time\nTill we meet face to face and you tell me you're mine\nIf I find you, girl, I swear I'll be a good man\nI'm not gonna leave it in destiny's hands\nI can't sit and wait for my princess to arrive\nI gotta struggle and fight to keep my dream alive\nI'll search the whole world for that special girl\nWhen I finally find you watch our love unfurl\n\n[Hook]\nI need love\nI need love\n\n[Outro]\nGirl, listen to me. When I be sitting in my room all alone, staring at the wall\nFantasies, they go through my mind, and I've come to realize that I need true love\nAnd if you wanna give it to me, girl, make yourself seen. I'll be waiting\nI love you"
    },
    {
        "Title": " Renee",
        "Artist": "Lost Boyz",
        "Year": " (1996)",
        "Lyrics": "[Verse 1]\nHere's a tune about this honey named Renee that I met one day\nOn my way back from John Jay\nI'm peeping shorty as she's walking to the train\nI tap her on her shoulders\n\"Excuse me miss, but can I get your name?\"\nShe said, my name is Renee\nI said I got a whole lot to say, so may I walk you to your subway?\nShe said if you want, so yo, we started talking\nI bought two franks and two drinks and we began walking\nI had to see where that head was at cause her gear was mad fat\nSo we must chat about this and that\nShe told me what she was in school for\nShe wants to be a lawyer, in other words, shorty studies law\nI'm telling shorty I'm a writer\nAnd as she's looking for the token, she drops a package of the EZ Wider\nCovers her mouth with her name ring\nI said, yo don't sweat the technique, shorty rocks, I do the same thing\nBut yet I use Philly blunts\nShe said, \"I never dealt with Philly blunts\nBecause I heard that's for silly stunts\"\nI said nah they burn slower\nRight now I really don't know ya\nBut maybe later on, I can get to show you\n\n[Hook]\nA ghetto love is the law that we live by\nDay by day I wonder why my shorty had to die\nI reminisce over my ghetto princess everyday\nGive it up for my shorty\nA ghetto love is the law that we live by\nDay by day I wonder why my shorty had to die\nI reminisce over my ghetto princess everyday\nGive it up for my shorty\n\n[Verse 2]\nSo now we sitting on the train\nBesides her fingernails, now shorty got the hairdo of pain\nNow understand she got flava\nA tough leather jacket with some jeans and a chain that her moms gave her\nGot off the train about 6:34\nShe wasn't sure she had grub for the dog, so we hit the store\nWent to the crib and turned the lights on\nA mad magazine stand\nFrom Essence to Right On\nA leather couch, stereo system with crazy CDs\nUnderstand, kid, she got G's\nShe said Cheeks, do what you want\nShe said I'm gonna feed the dog\nI said, alright well I'ma roll this blunt\nShe came back with stretch pants and a ponytail, a t-shirt\nA yo, fam I got a tender-roni girl\nWe're sitting on the couch chatting\nWe're smoking blunts off the balcony\nWe're staring at Manhattan now\nShe started feeling on my chest\nI started feeling on the breasts\nAnd there's no need for me to stress the rest\nA yo, I got myself a winner\nWe sparked a blunt before we ate and a blunt after we ate dinner\nShe had a tattoo she only wanted go to see\nBut first dim the lights and turn up the Jodeci\nI'm like whatever, shorty rock, we can swing it like that\n'Cause on the real this is where it's at\n\n[Hook]\nA ghetto love is the law that we live by\nDay by day I wonder why my shorty had to die\nI reminisce over my ghetto princess everyday\nGive it up for my shorty\nA ghetto love is the law that we live by\nDay by day I wonder why my shorty had to die\nI reminisce over my ghetto princess everyday\nGive it up for my shorty\n\n[Verse 3]\nI woke up the next day on the waterbed\nA letter's on the pillow and this what the letter said\nIt said, \"Cheeks, I'll be home around two\nYou was deep in your sleep so I didn't want to bother you\"\nI left my number for shorty to call me later\nGot dressed, smoked a blunt, and then I bounced towards the elevator\nI got a beep around three\nI'm asking shorty what's up with you, she's asking what's up with me\nAnd now we been together for weeks\nCandlelight dinner with my shorty, crack a forty with my naughty freaks\nHey man, I never been in love\nBut every time I'm burstin' in and outta state, it's Shorty that I'm thinking of\nI'm hanging out with my crew\nI get a beep from Renee because Renee uses Code Two\nBut yet I'm chattin' with her mom dukes\nShe says \"Renee has been shot, so Cheeks, meet me up at St. Luke's\"\nI jumps on the Van Wyck, I gotta make it there quick\nAy yo , this shit is gettin' mad thick\nNot even thinking about the po-nine\nI'm doing a buck, who gives a fuck, I'm smokin' boom and the whole nine\nI gotta see what's going on\nBut by the time I reach the hospital, they tell me \"Mr. Cheeks, Renee is gone\"\nI'm pouring beer out for my Shorty who ain't here\nI'm from the ghetto, so listen, this is how I shed my tears\n\n[Hook]\nA ghetto love is the law that we live by\nDay by day I wonder why my shorty had to die\nI reminisce over my ghetto princess everyday\nGive it up for my shorty\nA ghetto love is the law that we live by\nDay by day I wonder why my shorty had to die\nI reminisce over my ghetto princess everyday\nGive it up for my shorty\nA ghetto love is the law that we live by\nDay by day I wonder why my shorty had to die\nI reminisce over my ghetto princess everyday\nGive it up for my shorty\nA ghetto love is the law that we live by\nDay by day I wonder why my shorty had to die\nI reminisce over my ghetto princess everyday\nGive it up for my shorty"
    },
    {
        "Title": " Interlude (That's Love)",
        "Artist": "Chance the Rapper",
        "Year": " (2013)",
        "Lyrics": "[Intro]\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah\nYeah\nYeah, yeah, yeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah, yeah yeah, yeah, yeah, yeah\n\n[Verse]\nWhat's better than tripping is falling in love\nWhat's better than Letterman, Leno, Fallon, and all the above\nWhat's better than popping bottles trying to ball in the club\nIs the first caveman pops with his son, ball and a club\nWhat's better than paper is ballin' it up\nWhat's better than followers is actually fallin' in love\nWhat's better than frolicking, follies, fallin' in mud\nRolling in green pastures, wanderin', followin' love\nWhat's better than eating is feeding your fam\nWhat's better than meetings is missing meetings to meet with your fam\nWhat's better than leaning and needing a Xan\nIs hitting your xan dreaming a dream could mean leaving the land\nWhat's better than yelling is hollerin' love\nWhat's better than rhymes, nickels, dimes and dollars and dubs\nIs dialing up your darling just for callin' her up\nIt ain't nothing better than fallin' in love\nIgh\n\n[Chorus]\nI've seen it come back, back, back and forth\nYou hit the nail right on top of the head\nI know you've seen it all before\nBut when it looks you in the eyes\nIt ain't nothin' you could say but \"That's love\"\nThat's love\nThat's love\nThat's love\nSay that's love, ooh, ooh\nThat's love\nThat's love\nThat's love, that's love, that's love\nI love you (You love who?)\nI love you (Tell 'em who you love)\nI love you (You love who?)\nI love you (Yeah)\nI love you (Sing it right now)\nI love you (Love)\nI love you (Who do you love?)\nI love you (Love)\nI love you\nThat's love\nThat's love, that's love\nSay that's love, ooh, ooh, that's love (Love)\nThat's love, that's love, that's love, that's love, igh"
    },
    {
        "Title": " Bonita Applebum",
        "Artist": "A Tribe Called Quest",
        "Year": " (1990)",
        "Lyrics": "[Intro: Q-Tip]\nDo I love you?\nDo I lust for you?\nAm I a sinner because I do the two?\nCan you let me know\nRight now, please\nBonita Applebum\n\n[Hook]\nBonita Applebum, you gotta put me on\nBonita Applebum, I said you gotta put me on\nBonita Applebum, you gotta put me on\nBonita Applebum, I said you gotta put me on\nBonita Applebum, you gotta put me on\nBonita Applebum, I said you gotta put me on\nBonita Applebum, you gotta put me on\nBonita, Bonita, Bonita\n\n[Verse 1: Q-Tip]\nHey Bonita, glad to meet ya\nFor the cunning, stunning you, miss, I must beseech ya\nHey, being with you is a top priority\nAin't no need to question the authority\nChairman of the board, the chief of affections\nYou got mine's to swing in your direction\nHey, you're like a hip hop song, you know?\nBonita Applebum, you gotta put me on\n\n[Hook]\nBonita Applebum, you gotta put me on\nBonita Applebum, I said you gotta put me on\nBonita Applebum, you gotta put me on\nBonita Applebum, I said you gotta put me on\nBonita Applebum, you gotta put me on\nBonita Applebum, I said you gotta put me on\nBonita Applebum, you gotta put me on\nBonita, Bonita, Bonita\n\n[Verse 2: Q-Tip]\n38-24-37 (mmm, mmm, mmm)\nYou and me, hun, we're a match made in heaven\nI like to kiss ya where some brothers won't\nI like to tell ya things some brothers don't\nIf only you could see through your elaborate eyes\nOnly you and me, hun, the love never dies\nSatisfaction, I have the right tactics\nAnd if you need 'em, I got crazy prophylactics\nSo far, I hope you like rap songs\nBonita Applebum, you gotta put me on\n\n[Hook]\nBonita Applebum, you gotta put me on\nBonita Applebum, I said you gotta put me on\nBonita Applebum, you gotta put me on\nBonita Applebum, I said you gotta put me on\nBonita Applebum, you gotta put me on\nBonita Applebum, I said you gotta put me on\nBonita Applebum, you gotta put me on\nBonita, Bonita, Bonita\n\n[Outro]\nAyo\nWho’s having a ball?\nAnd you know, they ask me to get on the mic\nAnd they ask me\nCan I kick it?\nWord\n(Yes you can!)\nCan I kick it?"
    },
    {
        "Title": " Passin' Me By",
        "Artist": "The Pharcyde",
        "Year": " (1993)",
        "Lyrics": "[Produced by J-Swift]\n\n[Verse 1: Bootie Brown]\nNow in my younger days I used to sport a shag\nWhen I went to school I carried lunch in a bag\nWith an apple for my teacher cause I knew I'd get a kiss\nAlways got mad when the class was dismissed\nBut when it was in session, I always had a question\nI would raise my hand to make her stagger to my desk and\nHelp me with my problem, it was never much\nJust a trick, to smell her scent and try to sneak a touch\nOh, how I wish I could hold her hand and give her a hug\nShe was married to the man, he was a thug\nHis name was Lee, he drove a Z\nHe'd pick her up from school promptly at three o'clock\nI was on her jock, yes indeedy I wrote graffiti on the bus\nFirst I'd write her name then carve a plus\nWith my name last, on the looking glass\nI seen her yesterday but still I had to let her pass\n\n[Chorus]\nShe keeps on passing me by\nShe keeps on passing me by\n(Nevertheless, I'll say it again)\nShe keeps on passing me by\n(Nevertheless, I'll say it again)\nShe keeps on pa--\n\n[Verse 2: SlimKid 3]\nWhen I dream of fairytales I think of me and Shelly\nSee she's my type of hype and I can't stand when brothers tell me\nThat I should quit chasin' and look for something better\nBut the smile that she shows makes me a go-getter\nI haven't gone as far as asking if I could get with her\nI just play it by ear and hope she gets the picture\nI'm shooting for her heart, got my finger on the trigger\nShe could be my broad, and I could be her nigga\nBut, all I can do was stare\nBack as kids we used to kiss when we played truth or dare\nNow she's more sophisticated, highly edu-ma-cated\nNot at all overrated, I think I need a prayer\nTo get in her book and it looks rather dry\nI guess a twinkle in her eye is just a twinkle in her eye\nAlthough she's crazy stepping, I'll try to stop her stride\n'Cause I won't have no more of this passing me by\n\n[Verse 3: Imani]\nTime for me to voice my opinion can't be pretending she didn't have me\nSprung like a chicken, chasing my tail like a doggie\nShe was kind of like a star, thinking I was like a fan\nDamn, she looked good, downside: she had a man\nHe was a rooty-toot, a nincompoop\nShe told me soon your little birdie's gonna fly the coop\nShe was a flake like corn, and I was born not to understand\nBy letting her pass I had proved to be a better man\n\n[Chorus]\nShe keeps on passing me by\nShe keeps on passing me by\n(Nevertheless, I'll say it again)\nShe keeps on passing me by\n(Nevertheless, I'll say it again)\nShe keeps on passing me\n\n[Verse 4: Fatlip]\nNow there she goes again, the dopest Ethiopian\nAnd now the world around me begins moving in slow motion when-\nEver she happens to walk by - why does the apple of my eye\nOverlook and disregard my feelings no matter how much I try?\nWait, no, I did not really pursue my little princess with persistence\nAnd I was so low-key that she was unaware of my existence\nFrom a distance I desired her, secretly admired her\nWired her a letter to get her, and it went\nMy dear, my dear, my dear, you do not know me but I know you very well\nNow let me tell you about the feelings I have for you\nWhen I try or make some sort of attempt, I symp\nDamn I wish I wasn't such a wimp\nCause then I would let you know that I love you so\nAnd if I was your man then I would be true\nThe only lying I would do is in the bed with you\nThen I signed sincerely, the one who loves you dearly, PS Love Me Tender\nThe letter came back three days later: Return to Sender, damn\n\n[Chorus]\nShe keeps on passing me by\nShe keeps on passing me by\n(Nevertheless, I'll say it again)\nShe keeps on passing me by\n(Nevertheless, I'll say it again)\nShe keeps on passing me by\n(Nevertheless, I'll say it again)\nShe keeps on pa--\n(Nevertheless, I'll say it again)\nPassing me by\n(Nevertheless, I'll say it again)\n(Nevertheless)\n(Nevertheless)\n(Nevertheless, I'll say it again)\nShe keeps on passing me by\nShe keeps on passing me by\n(I'll say it again)\nShe keeps on passing me by\nShe keeps on passing me by\n(I'll say it again)\nShe keeps on passing me by\nShe keeps on passing me by\n(I'll say it again)\nShe keeps on passing me by\nShe keeps on passing me by\n(I'll say it again)"
    }
]